Repository: datalens-tech/datalens-backend
Catalog: lib/dl_api_connector/dl_api_connector/locales/*/LC_MESSAGES/dl_api_connector.po
Languages: ru

# field_host
source: Hostname
ru: Имя хоста

# field_port
source: Port
ru: Порт

# field_path
source: URL path
ru: URL-адрес

# field_username
source: Username
ru: Имя пользователя

# field_password
source: Password
ru: Пароль

# field_db-name
source: Path to database
ru: Путь к базе данных

# value_raw-sql-level-off
source: Forbid
ru: Запретить

# label_allow-subselect-hint-2
source: We do not recommend combining subqueries in datasets with RLS or restrictions on viewing tables.
ru: Не рекомендуем совмещать подзапросы в датасетах с RLS или каким-либо ограничением на просмотр таблиц.

# label_allow-subselect-hint-3
source: SQL queries from charts enter the connection directly and do not take into account the RLS configured in the datasets.
ru: SQL-запросы из чартов попадают напрямую в подключение и не учитывают настроенные RLS в датасетах.

# field_raw-sql-level
source: Raw SQL level
ru: Уровень доступа SQL запросов

# field_access-token
source: Access token
ru: Токен доступа

# field_auto-create-dashboard
source: Automatically create a dashboard, charts, and a dataset on the connection
ru: Автоматически создать дашборд, чарты и датасет над подключением

# label_advanced-settings
source: Advanced connection settings
ru: Продвинутые настройки подключения

# value_ssl-enabled-off
source: Off
ru: Выкл

# value_ssl-enabled-on
source: On
ru: Вкл

# label_data-export-forbidden
source: Disable data export
ru: Запрет на экспорт данных

# help_text_data-export-forbidden
source: Disabling data export will hide the data export button in the charts, though you will still be able to extract data from charts and take screenshots.
ru: При включении опции в чартах будет скрыта кнопка экспорта данных. При этом останется возможность извлекать данные из чартов, а также снимать скриншоты.

# value_data-export-forbidden-off
source: Off
ru: Выкл

# value_data-export-forbidden-on
source: On
ru: Вкл
