Repository: datalens-tech/datalens-backend
Catalog: lib/dl_formula_ref/dl_formula_ref/locales/*/LC_MESSAGES/dl_formula_ref_dl_formula_ref.po
Languages: ru

source: Returns: * 0 if {arg:0} and {arg:1} differs by not more than {arg:2}. * -1 if {arg:0} is less than {arg:1} by more than {arg:2}. * 1 if {arg:0} is greater than {arg:1} by more than {arg:2}.
ru: Возвращает: * 0, если {arg:0} и {arg:1} отличаются не более чем на {arg:2}. * -1, если {arg:0} меньше {arg:1} более чем на {arg:2}. * 1, если {arg:0} больше {arg:1} более чем на {arg:2}.

source: Inverts a Boolean value.
ru: Инвертирует логическое значение.

source: Negation (-)
ru: Отрицание (-)

source: Returns the number {arg:0} with the opposite sign.
ru: Возвращает число {arg:0} с противоположным знаком.

source: Checks whether the value of {arg:0} is true (`TRUE`). The `{argn:0} IS NOT TRUE` option returns the opposite value.
ru: Проверяет, является ли значение {arg:0} истинным (`TRUE`). Вариант `{argn:0} IS NOT TRUE` возвращает противоположное значение.

source: Checks whether the {arg:0} value is false (`FALSE`). The `{argn:0} IS NOT FALSE` option returns the opposite value.
ru: Проверяет, является ли значение {arg:0} ложным (`FALSE`). Вариант `{argn:0} IS NOT FALSE` возвращает противоположное значение.

source: Power (^)
ru: Степень (^)

source: Multiplication (*)
ru: Умножение (*)

source: If both arguments are numbers, it returns the result by multiplying {arg:0} by {arg:1}. If one of the arguments is {type:STRING} and the other is {type:INTEGER}, it returns the string repeated the specified number of times.
ru: Если оба аргумента — числа, то возвращает результат умножения числа {arg:0} на число {arg:1}. Если один из аргументов — {type:STRING}, а другой — {type:INTEGER}, возвращает строку, повторенную заданное количество раз.

source: Division (/)
ru: Деление (/)

source: Divides the number {arg:0} by the number {arg:1}.
ru: Делит число {arg:0} на число {arg:1}.

source: Modulo (%)
ru: Остаток (%)

source: Returns the remainder from dividing the first number {arg:0} by the second number {arg:1}.
ru: Возвращает остаток от деления первого числа {arg:0} на число {arg:1}.

source: Addition and concatenation (+)
ru: Сложение и конкатенация (+)

source: Behaves differently depending on the argument types. Possible options are listed in the table: {table: desc_by_type} Changing the order of arguments does not affect the result.
ru: Имеет различное поведение в зависимости от типов аргументов. Возможные варианты приведены в таблице: {table: desc_by_type} Изменение порядка аргументов не влияет на результат.

source: Type of {arg:0}
ru: Тип {arg:0}

source: Type of {arg:1}
ru: Тип {arg:1}

source: Return value
ru: Возвращаемое значение

source: The sum of the numbers {arg:0} and {arg:1}.
ru: Сумма чисел {arg:0} и {arg:1}.

source: The date that is {arg:1} days greater than {arg:0} (rounded down to an integer number of days).
ru: Дата, на {arg:1} дней большая, чем {arg:0} (с округлением вниз до целого количества дней).

source: The date with time, {arg:1} days greater than {arg:0}. If {arg:1} contains a fractional part, it is converted hours (`1/24`), minutes (`1/1440`), and seconds (`1/86400`).
ru: Дата со временем, на {arg:1} дней большая, чем {arg:0}. Если {arg:1} содержит дробную часть, то она пересчитывается в часы (`1/24`), минуты (`1/1440`) и секунды (`1/86400`).

source: The merging (concatenation) of strings {arg:0} and {arg:1}.
ru: Объединение (конкатенация) строк {arg:0} и {arg:1}.

source: The merging (concatenation) of arrays {arg:0} and {arg:1}.
ru: Объединение (конкатенация) массивов {arg:0} и {arg:1}.

source: Subtraction (-)
ru: Вычитание (-)

source: Behaves differently depending on the argument types. Possible options are listed in the table: {table: desc_by_type}
ru: Имеет различное поведение в зависимости от типов аргументов. Возможные варианты приведены в таблице: {table: desc_by_type}

source: The difference between the numbers {arg:0} and {arg:1}.
ru: Разность чисел {arg:0} и {arg:1}.

source: The date that is {arg:1} days smaller than {arg:0} (rounded down to an integer number of days).
ru: Дата, на {arg:1} дней меньшая, чем {arg:0} (с округлением вниз до целого количества дней).

source: The date with time, {arg:1} days smaller than {arg:0}. If {arg:1} contains a fractional part, it is converted to hours (`1/24`), minutes (`1/1440`), and seconds (`1/86400`).
ru: Дата со временем, на {arg:1} дней меньшая, чем {arg:0}. Если {arg:1} содержит дробную часть, то она пересчитывается в часы (`1/24`), минуты (`1/1440`) и секунды (`1/86400`).

source: The difference between two dates in days.
ru: Разность двух дат в днях.

source: The difference between two dates in days: the integer part — the number of whole days, the fractional part — the number of hours, minutes and seconds expressed as a fraction of the whole day (1 hour is '1/24').
ru: Разность двух дат в днях: целая часть — количество целых дней, дробная — количество часов, минут и секунд как долей целого дня (час — `1/24` и т.д.).

source: Matches the string {arg:0} to the template {arg: 1} and returns `TRUE` on match. You can specify the value in {arg:1} or use the `%` character to match a string of any length. The `{argn:0} NOT LIKE` option returns the opposite value. When comparing values, the function is case-sensitive. You can use `LIKE` along with {ref:UPPER} or {ref:LOWER} for case-insensitive comparison.
ru: Сравнивает строку {arg:0} со шаблоном {arg:1} и в случае совпадения возвращает `TRUE`. В качестве {arg:1} можно задать значение или использовать знак `%`, который соответствует строке любой длины. Вариант `{argn:0} NOT LIKE` возвращает противоположное значение. Функция учитывает регистр символов при сравнении значений. Вы можете использовать `LIKE` совместно с функциями {ref:UPPER} или {ref:LOWER}, чтобы производить сравнение без учета регистра символов.

source: Comparison
ru: Сравнение

source: Compares the value {arg:0} with the value {arg:1}.
ru: Сравнивают значение {arg:0} со значением {arg:1}.

source: Equality
ru: Равенство

source: Inequality
ru: Неравенство

source: Less than
ru: Меньше

source: Less than or equal
ru: Меньше или равно

source: Greater than
ru: Больше

source: Greater than or equal
ru: Больше или равно

source: Performs a Boolean join of two expressions with the `AND` condition.
ru: Выполняет логическое соединение двух выражений по условию `И`.

source: Performs a Boolean join of two expressions with the `OR` condition.
ru: Выполняет логическое соединение двух выражений по условию `ИЛИ`.

source: Checks whether the value matches at least one of the values listed in `IN(...)`. The option `{argn:0} NOT IN (<{arg:1}>)` returns the opposite value.
ru: Проверяет условие соответствия значения хотя бы одному из значений, перечисленных в `IN(...)`. Вариант `{argn:0} NOT IN (<{arg:1}>)` возвращает противоположное значение

source: Returns `TRUE` if {arg:0} is in the range from {arg:1} to {arg:2} inclusive. The option `{argn:0} NOT BETWEEN {argn:1} AND {argn:2}` returns the opposite value.
ru: Возвращает `TRUE`, если {arg:0} принадлежит диапазону значений с {arg:1} по {arg:2} включительно. Вариант `{argn:0} NOT BETWEEN {argn:1} AND {argn:2}` возвращает противоположное значение

source: Arguments {arg:0}, {arg:1}, {arg:2} must be of the same type.
ru: Тип аргументов {arg:0}, {arg:1}, {arg:2} должен совпадать.

source: Returns the numeric representation of the first character of the string.
ru: Возвращает числовое представление первого символа строки.

source: Converts the numeric representation of an ASCII character to a value.
ru: Преобразовывает числовое представление символа ASCII в значение.

source: Merges any number of strings. When non-string types are used, they're converted to strings and then merged.
ru: Объединяет произвольное количество строк. При использовании нестроковых типов происходит преобразование в строку и объединение.

source: Returns `TRUE` if {arg:0} contains {arg:1}. For case-insensitive searches, see {ref:ICONTAINS}.
ru: Возвращает `TRUE`, если строка {arg:0} содержит в себе подстроку {arg:1}. Для регистронезависимой проверки см. {ref:ICONTAINS}.

source: Case-insensitive version of {ref:string/CONTAINS}. Returns `TRUE` if {arg:0} contains {arg:1}.
ru: Регистронезависимый вариант {ref:string/CONTAINS}. Возвращает `TRUE`, если строка {arg:0} содержит в себе подстроку {arg:1}.

source: Returns `TRUE` if {arg:0} ends in {arg:1}. For case-insensitive searches, see {ref:IENDSWITH}.
ru: Возвращает `TRUE`, если строка {arg:0} оканчивается на подстроку {arg:1}.Для регистронезависимой проверки см. {ref:IENDSWITH}.

source: Case-insensitive version of {ref:ENDSWITH}. Returns `TRUE` if {arg:0} ends in {arg:1}.
ru: Регистронезависимый вариант {ref:ENDSWITH}. Возвращает `TRUE`, если строка {arg:0} оканчивается на подстроку {arg:1}.

source: Returns `TRUE` if {arg:0} starts with {arg:1}. For case-insensitive searches, see {ref:ISTARTSWITH}.
ru: Возвращает `TRUE`, если строка {arg:0} начинается на подстроку {arg:1}. Для регистронезависимой проверки см. {ref:ISTARTSWITH}.

source: Case-insensitive version of {ref:string/STARTSWITH}. Returns `TRUE` if {arg:0} starts with {arg:1}.
ru: Регистронезависимый вариант {ref:string/STARTSWITH}. Возвращает `TRUE`, если строка {arg:0} начинается на подстроку {arg:1}.

source: Returns the index of the position of the first character of the substring {arg:1} in the string {arg:0}. If the `start_index` option is specified, the search starts from the specified position.
ru: Возвращает индекс позиции первого символа подстроки {arg:1} в строке {arg:0}. Если указан опциональный параметр `start_index`, то поиск начнется с указанной позиции.

source: Returns a string that contains the number of characters specified in {arg:1} from the beginning of the string {arg:0}.
ru: Возвращает строку, которая содержит указанное количество символов {arg:1} с начала строки {arg:0}.

source: Returns a string that contains the number of characters specified in {arg:1} from the end of the string {arg:0}.
ru: Возвращает строку, которая содержит указанное количество символов {arg:1} с конца строки {arg:0}.

source: Returns the number of characters in the string or items in array {arg:0}.
ru: Возвращает количество символов в строке или элементов в массиве {arg:0}.

source: Returns the string {arg:0} in lowercase.
ru: Возвращает строку {arg:0} в нижнем регистре.

source: Returns the string {arg:0} in uppercase.
ru: Возвращает строку {arg:0} в верхнем регистре.

source: Returns the string {arg:0} without spaces at the beginning of the string.
ru: Возвращает строку {arg:0} без знаков пробела в начале строки.

source: Returns the string {arg:0} without spaces at the end of the string.
ru: Возвращает строку {arg:0} без знаков пробела в конце строки.

source: Returns the string {arg:0} without spaces at the beginning or end of the string.
ru: Возвращает строку {arg:0} без знаков пробела в начале и конце строки.

source: Returns the substring {arg:0} starting from the index {arg:1}. The numbering starts with one. If an additional argument `{argn:2}` is specified, a substring of the specified length is returned.
ru: Возвращает подстроку {arg:0}, начиная с индекса {arg:1}. Нумерация начинается с единицы. Если указан дополнительный аргумент `{argn:2}`, то будет возвращена подстрока указанной длины.

source: See the documentation of the data source to clarify the regular expression syntax. For example, {dialects:CLICKHOUSE} uses the {link: ch_re_link: RE2 syntax} to compose regular expressions.
ru: Информацию о синтаксисе регулярных выражений уточняйте в документации к источникам данных. Например, в {dialects:CLICKHOUSE} для составления регулярных выражений используется {link: ch_re_link: синтаксис RE2}.

source: Returns the substring {arg:0} that matches the regular expression {arg:1}.
ru: Возвращает подстроку {arg:0}, которая соответствует регулярному выражению {arg:1}.

source: Returns all {arg:0} substrings matching the {arg:1} regex. For regexes with subgroups, it only works for the first subgroup.
ru: Возвращает все подстроки {arg:0}, которые соответствуют регулярному выражению {arg:1}. Для регулярных выражений с подгруппами работает только для первой подгруппы.

source: Returns a substring {arg:0} that matches the regular expression pattern {arg:1} starting from the specified index.
ru: Возвращает подстроку {arg:0}, которая соответствует шаблону регулярного выражения {arg:1}, начиная с указанного индекса.

source: Returns 'TRUE' if the string {arg:0} has a substring that matches the regular expression pattern {arg:1}.
ru: Возвращает `TRUE`, если в строке {arg:0} есть подстрока, которая соответствует шаблону регулярного выражения {arg:1}.

source: Searches for a substring in the string {arg:0} using the regular expression pattern {arg:1} and replaces it with the string {arg:2}. If the substring is not found, the string is not changed.
ru: Ищет подстроку в строке {arg:0} по шаблону регулярного выражения {arg:1} и заменяет ее строкой {arg:2}. Если подстрока не найдена, то строка не будет изменена.

source: Searches for the substring {arg:1} in the string {arg:0} and replaces it with the string {arg:2}. If the substring is not found, the string is not changed.
ru: Ищет подстроку {arg:1} в строке {arg:0} и заменяет ее строкой {arg:2}. Если подстрока не найдена, то строка не будет изменена.

source: Returns a string with the specified number of spaces.
ru: Возвращает строку с указанным количеством пробелов.

source: It splits {arg:0} into a sequence of substrings using the {arg:1} character as separator and returns the substring whose number is equal to the {arg:2} parameter. By default, the delimiting character is comma. If {arg:2} is negative, the substring to return is counted from the end of {arg:0}. If the number of substrings is less than the {arg:2} {link: abs_value_link: absolute value}, the function returns an empty string. If {arg:2} was not provided, the function returns an array of the substrings (only for {dialects:CLICKHOUSE|POSTGRESQL} sources).
ru: Разделяет {arg:0} на последовательность подстрок, используя символ разделителя {arg:1}, и возвращает подстроку, порядковый номер которой равен параметру {arg:2}. Разделитель по умолчанию — запятая. Если {arg:2} отрицательный, отсчет возвращаемой подстроки ведется с конца {arg:0}. Если количество подстрок меньше, чем {link: abs_value_link: абсолютное значение} {arg:2}, возвращается пустая строка. Если не передан {arg:2}, то возвращается массив подстрок (только для источников {dialects:CLICKHOUSE|POSTGRESQL}).

source: Converts the {arg:0} string encoding to `UTF8`.
ru: Переводит кодировку строки {arg:0} в `UTF8`.

source: The first argument must be a measure (aggregated expression), otherwise an error will be raised.
ru: Первый аргумент функции должен быть показателем (агрегированным выражением). Отсутствие показателя приведет к ошибке.

source: Re-evaluate {arg:0} for a date/time with a given offset. The {arg:1} argument is the dimension along which the offset is made. The {arg:3} argument sets the offset in units of the {arg:2} argument. Set as an integer. It may take negative values. The default value is `1`. The {arg:2} argument sets the unit for {arg:3}. It may take the following values: - `"year"`; - `"month"`; - `"week"`; - `"day"` (default value); - `"hour"`; - `"minute"`; - `"second"`. Can also be used as `AGO( measure, date_dimension, number )`. In this case, the {arg:2} argument takes the `"day"` value. See also {ref:AT_DATE}, {ref:LAG}.
ru: Вычисляет значение показателя {arg:0} для даты/времени с указанным смещением. Аргумент {arg:1} задает измерение, вдоль которого делается смещение. Аргумент {arg:3} задает размер смещения в единицах аргумента {arg:2}. Задается целым числом. Может принимать отрицательные значения. Значение по умолчанию равно `1`. Аргумент {arg:2} задает единицу измерения для {arg:3}. Принимает следующие значения: - `"year"` — год; - `"month"` — месяц; - `"week"` — неделя; - `"day"` — день (значение по умолчанию); - `"hour"` — час; - `"minute"` — минута; - `"second"` — секунда. Возможен вариант использования `AGO( measure, date_dimension, number )`. В этом случае аргумент {arg:2} принимает значение `"day"`. См. также {ref:AT_DATE}, {ref:LAG}.

source: Re-evaluate {arg:0} for a date/time specified by {arg:2}. It allows to get the measure at the beginning and at the end of a period, or for the specified date. The {arg:1} argument is the dimension along which the offset is made. You can use the following as the {arg:2} argument: * Certain date. * Function {ref:TODAY} to obtain the current date. * Functions to calculate date and time. See also {ref:AGO}, {ref:LAG}.
ru: Вычисляет {arg:0} для даты/времени, заданных выражением {arg:2}. Позволяет получить показатель на начало или конец периода, или на конкретную дату. Аргумент {arg:1} задает измерение, вдоль которого делается смещение. В качестве аргумента {arg:2} можно использовать: * конкретную дату; * функцию получения текущей даты {ref:TODAY}; * функции для вычисления даты и времени. См. также {ref:AGO}, {ref:LAG}.

source: Converts the {arg:0} expression to date format. The date must be in the format `YYYY-MM-DD`. If {arg:0} is a number, then the {arg:1} option can be used to convert the date to the specified time zone.
ru: Переводит выражение {arg:0} в формат даты. Дата должна быть определена в формате `YYYY-MM-DD`. Если {arg:0} является числом, то при наличии дополнительного параметра {arg:1} дата рассчитывается для указанной временной зоны.

source: Argument {arg:1} is available only for {dialects:CLICKHOUSE} sources.
ru: Параметр {arg:1} доступен только для источников {dialects:CLICKHOUSE}.

source: Converts the {arg:0} expression to date and time format. When converting `Date` to `DateTime`, the time is set to '00:00:00'. The date must be in the format `YYYY-MM-DDThh:mm:ss` or `YYYY-MM-DD hh:mm:ss`. Numeric values are rendered as time in {link: unix_ts: Unix time} format or equal to the number of seconds elapsed since 00:00:00 on January 1, 1970, less the adjustments for leap seconds. The date and time can be converted to the specified {link: timezone_link: time zone} when the {arg:1} option is available. The {arg:1} parameter must be specified in `Region/Data_Zone` format.
ru: Переводит выражение {arg:0} в формат даты и времени. При переводе `Date` в `DateTime` время определяется, как `00:00:00`. Дата должна быть определена в формате `YYYY-MM-DDThh:mm:ss` или `YYYY-MM-DD hh:mm:ss`. Числовые значения воспринимаются как время в формате {link: unix_ts: Unix time} и равны количеству секунд, прошедших с 00:00:00 1 января 1970 года, за вычетом поправок, сделанных из-за високосных секунд. При наличии дополнительного параметра {arg:1} дата и время рассчитываются для указанной {link: timezone_link: временной зоны}. Параметр `timezone` должен быть определен в формате `Region/Data_Zone`.

source: Converts the {arg:0} expression to fractional number format according to the following rules: {table: conversion}
ru: Переводит выражение {arg:0} в формат дробного числа по следующим правилам: {table: conversion}

source: Type
ru: Тип

source: Value
ru: Значение

source: Original value.
ru: Исходное значение.

source: {link: unix_ts: Unix time} corresponding to the date and time. If the value contains time zone data, it's used in the calculation. If the time zone is unknown, the time is set in UTC.
ru: {link: unix_ts: Unix-время} соответствующее дате и времени. Если значение содержит в себе информацию о временной зоне, то она учитывается при вычислении. Если же временная зона неизвестна, то время считается UTC.

source: A number from a decimal string.
ru: Число из строки в десятичной записи.

source: Converts the {arg:0} expression to integer format according to the following rules: {table: conversion}
ru: Переводит выражение {arg:0} в формат целого числа по следующим правилам: {table: conversion}

source: Integer part of the number (rounded down).
ru: Целая часть числа (округление вниз).

source: Converts the {arg:0} expression to Boolean type according to the following rules: {table:conversion}
ru: Переводит выражение {arg:0} в логический тип по следующим правилам: {table: conversion}

source: All others
ru: Все остальные

source: Empty string (`""`)
ru: Пустая строка (`""`)

source: Converts the {arg:0} expression to string type.
ru: Переводит выражение {arg:0} к типу строки.

source: If an array is passed (only for {dialects:CLICKHOUSE|POSTGRESQL} sources), the conversion is performed by a function in the source database and results may vary for different data sources. For consistent results use {ref:ARR_STR}.
ru: Если передан массив (только для источников {dialects:CLICKHOUSE|POSTGRESQL}), то преобразование осуществляется функцией источника и результат для разных источников может отличаться. Для получения одинакового результата используйте {ref:ARR_STR}.

source: Converts the {arg:0} expression to date and time format. Unlike {ref: DATETIME}, it supports multiple formats. The expression is processed on the {{ CH }} source side. For more information on the supported formats, see the relevant {{ CH }} {link: ch_parseDateTime: documentation}.
ru: Переводит выражение {arg:0} в формат даты и времени. В отличие от {ref: DATETIME}, поддерживает множество форматов. Обработка выражения происходит на стороне источника {{ CH }}. Подробнее о поддерживаемых форматах читайте в {link: ch_parseDateTime: документации} {{ CH }}.

source: Converts the {arg:0} expression to date format. Unlike {ref: DATE}, it supports multiple formats.
ru: Переводит выражение {arg:0} в формат даты. В отличие от {ref: DATE}, поддерживает множество форматов.

source: Generates a Geopoint type value. For the input, it accepts a string, a "geopoint" type value, or coordinates — latitude {arg:0} and longitude {arg:1}. If a single string is input, it must contain a list of two numbers (latitude and longitude) in JSON syntax.
ru: Формирует значение типа геоточка. Принимает на вход строку, либо значение типа "геоточка", либо координаты — широту {arg:0} и долготу {arg:1}. Если на вход подается одна строка, в ней должен содержаться список из двух чисел, координат (широты и долготы) в JSON-синтаксисе.

source: Converts the {arg:0} expression to {link: geopolygon_link: geopolygon} format. At input, the function accepts strings in `[[[lat_1,lon_1], [lat_2,lon_2], ..., [lat_N-1,lon_N-1], [lat_N,lon_N]]]` format.
ru: Переводит выражение {arg:0} в формат {link: geopolygon_link: геополигона}. Функция принимает на вход строку вида `[[[lat_1,lon_1], [lat_2,lon_2], ..., [lat_N-1,lon_N-1], [lat_N,lon_N]]]`.

source: Data source
ru: Источник данных

source: Data type
ru: Тип данных

source: Native data type
ru: Нативный тип

source: Parameters for native type
ru: Параметры нативного типа

source: Comment
ru: Комментарий

source: Converts the {arg:0} expression to database's native type {arg:1}. The following type casts are supported: {table:supported_native_types}
ru: Переводит выражение {arg:0} в указанный нативный тип данных {arg:1}. Поддерживаются следующие типы: {table:supported_native_types}

source: Converts the {arg:0} expression to `Tree of strings` format. Can be used to create {link: tree_link: tree hierarchies}.
ru: Переводит выражение {arg:0} в формат `Дерево строк`. Используется для создания {link: tree_link: древовидных иерархий}.

source: Example with grouping
ru: Пример с группировкой

source: Example with two arguments
ru: Пример с двумя аргументами

source: If {arg:1} is `"desc"` or omitted, then ranking is done from greatest to least, if `"asc"`, then from least to greatest.
ru: Если {arg:1} равно `"desc"` или не указано, то ранжирование происходит от большего к меньшему, если `"asc"`, то от меньшего к большему. По умолчанию используется `"desc"`.
