Repository: datalens-tech/datalens-backend
Catalog: lib/dl_formula_ref/dl_formula_ref/locales/*/LC_MESSAGES/dl_formula_ref_dl_formula_ref.po
Languages: ru

source: Example
ru: Пример

source: Function Reference
ru: Справочник функций

source: All Functions
ru: Все функции

source: Overview
ru: Обзор

source: Function Availability
ru: Поддержка функций

source: Arguments ({text:args}) must be of the same type.
ru: Тип аргументов ({text:args}) должен совпадать.

source: Only constant values are accepted for the arguments ({text:args}).
ru: Значения аргументов ({text:args}) должны быть константами.

source: Function `{text:func_name}` is also found in the following categories:
ru: Функция `{text:func_name}` также доступна в следующих категориях:

source: Depends on argument types
ru: Зависит от типов аргументов

source: Same type as ({text:args})
ru: Совпадает с типом аргументов ({text:args})

source: Any
ru: Любой

source: Aggregate functions
ru: Агрегатные функции

source: String functions
ru: Строковые функции

source: Mathematical functions
ru: Математические функции

source: Logical functions
ru: Логические функции

source: Date/Time functions
ru: Функции даты и времени

source: Type conversion functions
ru: Функции преобразования типов

source: Operators
ru: Операторы

source: Geographical functions
ru: Географические функции

source: Text markup functions
ru: Функции разметки

source: Window functions
ru: Оконные функции

source: Time series functions
ru: Функции для работы с временными рядами

source: Array functions
ru: Функции для работы с массивами

source: aggregation
ru: агрегатная

source: string
ru: строковая

source: mathematical
ru: математическая

source: logical
ru: логическая

source: date/time
ru: дата и время

source: type conversion
ru: преобразование типов

source: operator
ru: оператор

source: geographical
ru: географическая

source: text markup
ru: разметка

source: window
ru: оконная

source: time series
ru: временные ряды

source: array
ru: массивы

source: Integer
ru: Целое число

source: Fractional number
ru: Дробное число

source: Boolean
ru: Логический

source: String
ru: Строка

source: Date
ru: Дата

source: Datetime (deprecated)
ru: Дата и время (устаревший)

source: Datetime with timezone
ru: Дата и время с часовым поясом

source: Datetime
ru: Дата и время

source: Geopoint
ru: Геоточка

source: Geopolygon
ru: Геополигон

source: Markup
ru: Разметка

source: Array of fractional numbers
ru: Массив дробных чисел

source: Array of integers
ru: Массив целых чисел

source: Array of strings
ru: Массив строк

source: Tree
ru: Дерево

source: Standard
ru: Стандартный

source: Extended
ru: Расширенный

source: More info:
ru: Подробнее:

source: Aggregate functions (or aggregations) are functions that combine multiple values from a group of entries into one, thus collapsing the group into a single entry. If you add an aggregation to a dimension, it becomes a measure. Aggregate functions can be used with constants, such as `COUNT(1)` or `SUM(1)`. If the chart does not use other measures and dimensions, the result of such an expression will always be `1`. This is because the function does not include any fields, so {{ datalens-short-name }} accesses no source tables in the query. {text:agg_syntax} {text:agg_usage_restrictions}
ru: Агрегатные функции (агрегации) — это функции, которые вычисляются от группы значений и объединяют их в одно результирующее. Если в поле с измерением добавить агрегацию, то поле становится показателем. Агрегатные функции можно использовать с константами, например, `COUNT(1)` или `SUM(1)`. Если в чарте не используются другие показатели и измерения, результатом такого выражения всегда будет значение `1`. Это происходит из-за того, что в функции не указано ни одного поля, поэтому {{ datalens-short-name }} в запросе не обращается ни к одной таблице источника. {text:agg_syntax} {text:agg_usage_restrictions}

source: ## Syntax {#syntax} In most cases aggregate functions have the same syntax as regular functions: {text:agg_simple_signature} For advanced cases, extended syntax may be required to indicate a custom level of detail (LOD): {text:agg_extended_signature} {text:agg_syntax_lod} {text:agg_syntax_bfb}
ru: ## Синтаксис {#syntax} В большинстве случаев у агрегатных функций такой же синтаксис, как и у обычных функций: {text:agg_simple_signature} Для использования нестандартного уровня детализации (LOD) понадобится расширенный вариант: {text:agg_extended_signature} {text:agg_syntax_lod} {text:agg_syntax_bfb}

source: ### Level of Detail (LOD) {#syntax-lod} Custom LOD make possible nested aggregations and aggregations over the entire set of rows or groups that are different from the grouping at the chart's level. LOD can be specified using one of three keywords: * `FIXED` — data is grouped using the listed dimensions (`dim1, dim2, ...`) regardless of the dimensions used by the chart; * `INCLUDE` — the listed dimensions (`dim1, dim2, ...`) are combined with the chart's dimensions; * `EXCLUDE` — all of the chart's dimensions are used with the exception of those listed (`dim1, dim2, ...`). For any of these keywords the list may have any number of dimensions, or even be empty. Using `INCLUDE` or `EXCLUDE` without a dimension list is equivalent to grouping by dimensions of an external aggregation or by chart dimensions if there are no other aggregations over the current one. `FIXED` without a list means that all data will aggregate into a single group, e.g., for calculating the resulting value. Top-level aggregations must not contain any dimensions that are missing in the chart. Hence, if you need to add details or group by dimensions that are missing in the chart, you can add them in the lower levels. For example, if you need the maximum sales amount by cities without including data on cities to the chart, use: ``` MAX(SUM([Sales] FIXED [City])) ``` {text:agg_syntax_lod_inheritance} {text:agg_syntax_lod_examples} {text:agg_syntax_lod_consistency}
ru: ### Уровень детализации (LOD) {#syntax-lod} Управление уровнем детализации (англ. level of detail — LOD) позволяет создавать вложенные агрегации и агрегации над всеми данными или группами, отличающимися от группировки, заданной на уровне чарта. Уровень детализации может быть задан с помощью одного из трех ключевых слов: * `FIXED` — данные группируются по перечисленным измерениям (`dim1, dim2, ...`) вне зависимости от того, какие измерения используются в чарте; * `INCLUDE` — перечисленные измерения (`dim1, dim2, ...`) добавляются к измерениям чарта; * `EXCLUDE` — используются все измерения чарта, кроме перечисленных (`dim1, dim2, ...`). Для любого из этих ключевых слов список может содержать неограниченное количество измерений или быть пустым. Использование `INCLUDE` или `EXCLUDE` без списка измерений равносильно группировке по измерениям внешней агрегации или измерениям чарта, если над текущей агрегацией нет других. `FIXED` без списка означает, что все данные будут агрегированы в одной группе, например, для расчетов итоговых значений. Верхнеуровневые агрегации не должны содержать измерений, которых нет в чарте. Поэтому если нужно добавить детализацию или сделать группировку по отсутствующим в чарте измерениям, можно добавить их на нижних уровнях. Например, если нужен максимум продаж по городам без включения данных по городам в чарт: ``` MAX(SUM([Sales] FIXED [City])) ``` {text:agg_syntax_lod_inheritance} {text:agg_syntax_lod_examples} {text:agg_syntax_lod_consistency}

source: #### Dimension Inheritance {#syntax-lod-inheritance} Dimensions are inherited by nested aggregations from the ones they are inside of. The expression ``` AVG(MAX(SUM([Sales] INCLUDE [City]) INCLUDE [Category])) ``` in a chart with the additional dimension `[Date]` is equivalent to ``` AVG(MAX(SUM([Sales] FIXED [City], [Category], [Date]) FIXED [Category], [Date]) FIXED [Date]) ```
ru: #### Наследование измерений {#syntax-lod-inheritance} Вложенные агрегации наследуют измерения от тех агрегаций, внутри которых находятся. Выражение ``` AVG(MAX(SUM([Sales] INCLUDE [City]) INCLUDE [Category])) ``` в чарте с дополнительным измерением `[Date]` эквивалентно ``` AVG(MAX(SUM([Sales] FIXED [City], [Category], [Date]) FIXED [Category], [Date]) FIXED [Date]) ```

source: #### LOD Examples {#syntax-lod-examples} * Average daily sum of `[Sales]`: `AVG(SUM([Sales] INCLUDE [Date]))`; * Ratio of the (daily) sum of `[Sales]` to the total sum: `SUM([Sales]) / SUM([Sales] FIXED)`; * Sum of `[Sales]` of all orders that are smaller than average: `SUM_IF(SUM([Sales] INCLUDE [Order ID]), SUM([Sales] INCLUDE [Order ID]) < AVG([Sales] FIXED))`.
ru: #### Примеры LOD {#syntax-lod-examples} * Средняя дневная сумма `[Sales]`: `AVG(SUM([Sales] INCLUDE [Date]))`. * Отношение (дневной) суммы `[Sales]` к общей сумме: `SUM([Sales]) / SUM([Sales] FIXED)`. * Сумма `[Sales]` всех заказов, которые меньше среднего: `SUM_IF(SUM([Sales] INCLUDE [Order ID]), SUM([Sales] INCLUDE [Order ID]) < AVG([Sales] FIXED))`.

source: #### Dimension Compatibility {#syntax-lod-compatibility} If several aggregations with custom LODs are nested inside another, their sets of dimensions must be compatible, i.e. one of them must contain all of the others. Invalid expression: ``` SUM(AVG([Sales] INCLUDE [City]) - AVG([Sales] INCLUDE [Category])) ``` One of the nested aggregations has dimension `[City]`, while the other has `[Category]`, and there is no other that would contain both of these. Valid expression: ``` SUM( AVG([Sales] INCLUDE [City], [Category]) - (AVG([Sales] INCLUDE [City]) + AVG([Sales] INCLUDE [Category])) / 2 ) ``` One of the nested aggregations set of dimensions contains all of the others.
ru: #### Совместимость измерений {#syntax-lod-compatibility} Если несколько агрегаций с разными наборами измерений (LOD) находятся внутри другой агрегации, то их наборы измерений должны быть совместимы. То есть один из этих наборов должен содержать все остальные. Некорректное выражение: ``` SUM(AVG([Sales] INCLUDE [City]) - AVG([Sales] INCLUDE [Category])) ``` У одной из вложенных агрегаций измерение `[City]`, а у другой — `[Category]`. При этом нет другой агрегации, которая содержала бы оба эти измерения. Корректное выражение: ``` SUM( AVG([Sales] INCLUDE [City], [Category]) - (AVG([Sales] INCLUDE [City]) + AVG([Sales] INCLUDE [Category])) / 2 ) ``` У одной из вложенных агрегаций множество измерений содержит остальные.

source: ### BEFORE FILTER BY {#syntax-before-filter-by} If any fields are listed in `BEFORE FILTER BY`, then this aggregate function is calculated before data is filtered using these fields. `BEFORE FILTER BY` applies to all nested aggregate functions too. Example: * Formula — `AVG(SUM([Sales] INCLUDE [Date]) BEFORE FILTER BY [City])`. * Equivalent — `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [City]) BEFORE FILTER BY [City])`. Do not use conflicting `BEFORE FILTER BY` clauses: * Valid: `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [City], [Category]) BEFORE FILTER BY [City])` — functions are nested and (`[City]`) is a subset of (`[City], [Category]`). * Valid: `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [Category]) BEFORE FILTER BY [City])` — functions are nested, so field lists are combined in the second of the two functions. * Valid: `SUM([Sales] BEFORE FILTER BY [City], [Category]) - SUM([Sales] BEFORE FILTER BY [City])` — (`[City]`) is a subset of (`[City], [Category]`). * Not valid: `SUM([Sales] BEFORE FILTER BY [Category]) - SUM([Sales] BEFORE FILTER BY [City])` — functions are not nested and neither of (`[Category]`) and (`[City]`) is a subset of the other.
ru: ### BEFORE FILTER BY {#syntax-before-filter-by} Если какие-либо поля перечислены в `BEFORE FILTER BY`, то эта агрегатная функция будет рассчитана до фильтрации данных по этим полям. `BEFORE FILTER BY` применяется также и ко всем вложенным агрегатным функциям. Пример: * Формула — `AVG(SUM([Sales] INCLUDE [Date]) BEFORE FILTER BY [City])`. * Эквивалент — `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [City]) BEFORE FILTER BY [City])`. Не используйте конфликтующие `BEFORE FILTER BY` в запросе: * Корректная формула: `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [City], [Category]) BEFORE FILTER BY [City])` — функции вложены друг в друга, и (`[City]`) является подмножеством (`[City], [Category]`). * Корректная формула: `AVG(SUM([Sales] INCLUDE [Date] BEFORE FILTER BY [Category]) BEFORE FILTER BY [City])` — функции вложены друг в друга, поэтому списки полей комбинируются во второй из функций. * Корректная формула: `SUM([Sales] BEFORE FILTER BY [City], [Category]) - SUM([Sales] BEFORE FILTER BY [City])` — (`[City]`) является подмножеством (`[City], [Category]`). * Некорректная формула: `SUM([Sales] BEFORE FILTER BY [Category]) - SUM([Sales] BEFORE FILTER BY [City])` — функции не вложены, и ни одно из (`[Category]`) и (`[City]`) не является подмножеством другого.

source: ## Usage Restrictions {#usage-restrictions} There are the following features of using aggregations: a function or operator cannot have aggregate and non-aggregate expressions as its arguments simultaneously. The following usage is forbidden: `CONCAT([Profit], SUM([Profit]))`.
ru: ## Ограничения использования {#usage-restrictions} Существуют следующие особенности использования агрегаций: функция или оператор не может иметь среди своих аргументов одновременно агрегированные и неагрегированные выражения. Выражение `CONCAT([Profit], SUM([Profit]))` не поддерживается.

source: https://en.wikipedia.org/wiki/Standard_deviation
ru: https://ru.wikipedia.org/wiki/Среднеквадратическое_отклонение

source: https://en.wikipedia.org/wiki/Median
ru: https://ru.wikipedia.org/wiki/Медиана_(статистика)

source: aggregate functions,aggregations,aggregate data,level of detail,lod
ru: агрегатные функции,агрегации,агрегирующие функции,агрегированные данные,агрегирование данных,агрегирование,агрегация данных,level of detail,lod,уровень детализации

source: https://en.wikipedia.org/wiki/ISO_8601
ru: https://ru.wikipedia.org/wiki/ISO_8601

source: Markup functions are used for creating marked up text (hypertext) from string values and/or other marked up text. ## Usage notes {#usage-notes} There are the following features of using markup: 1. These functions return `NULL` when any argument is `NULL`. To get a non-NULL value, wrap argumens in `IFNULL()`. Example: `bold(ifnull([value], 'NULL'))`. 1. Converting markup to a normal string is not currently possible. 1. Markup functions can be used within logic functions. Example: `IF(STARTSWITH([value], 'n'), BOLD([value]), MARKUP([value]))`.
ru: Функции разметки используются для создания размеченного текста (гипертекста) из строковых значений и/или из другого размеченного текста. ## Особенности использования {#usage-notes} Существуют следующие особенности использования функций разметки: 1. Эти функции возвращают `NULL` при наличии `NULL` в любом из аргументов. Чтобы получить при этом значение, можно обернуть аргументы в `IFNULL()`. Пример: `BOLD(IFNULL([value], 'NULL'))`. 1. Конвертация размеченного текста в обычные строковые значения не поддерживается. 1. Функции разметки могут использоваться внутри логических функций. Пример: `IF(STARTSWITH([value], 'n'), BOLD([value]), MARKUP([value]))`.

source: Images can be added from the `*.yandex.ru`, `*.yandex.net`, `yastat.net`, `yastatic.net`, or `storage.yandexcloud.net` domains. The easiest way is to upload and publish the image in {link: storage_link: Yandex Object Storage} (see the pricing {link: storage_prices_link: here}).
ru: Допускается добавление изображений с доменов `*.yandex.ru`, `*.yandex.net`, `yastat.net`, `yastatic.net` или `storage.yandexcloud.net`. Самый простой способ — загрузить и опубликовать изображение в {link: storage_link: Yandex Object Storage} (ознакомьтесь с {link: storage_prices_link: правилами тарификации} сервиса).

source: https://en.wikipedia.org/wiki/Absolute_value
ru: https://ru.wikipedia.org/wiki/Абсолютная_величина

source: Time series functions provide various ways to look up values corresponding to a specific time or offset along a given time axis. In a certain way this functionality is similar to the window function {ref:LAG}. The main difference is that `LAG` is indifferent to the actual values of the dimensions being used, and operates over positional offsets specified in _rows_, while time series functions use specific values and value offsets in date/time units like days, hours or seconds. This makes them sensitive to missing values in data. As a result of this `AGO(SUM([Sales]), [Date], "year")` will return `NULL` if the same-date row for the previous year is missing. Time series functions work with specific values or deviations specified in time units (days, hours, or seconds). Due to that, they become sensitive to missing values in data. As the result, the `AGO(SUM([Sales]), [Date], "year")` formula will return `NULL` if there is no data for the same date in the previous year. Also, note that when you use data in date and time format, you might have data for the same date, but not for the exact same second. Besides, when rounding dates to weeks, a shift in years will also return `NULL`. {text:time_series_syntax}
ru: Эти функции позволяют получать значения показателя, отнесенного к конкретным дате и времени. Дата и время задаются либо точными значениями, либо в виде смещения вдоль заданной временной оси. В некоторой степени эти функции схожи с оконной {ref:LAG}. Основное отличие — `LAG` не учитывает значения измерений и использует смещение, заданное в виде количества строк. Функции временных рядов работают с конкретными значениями или смещениями, заданными во временных единицах (дни, часы или секунды). За счет этого они становятся чувствительными к пропущенным значениям в данных. В результате формула `AGO(SUM([Sales]), [Date], "year")` вернет `NULL`, если отсутствуют данные на ту же дату за предыдущий год. Также стоит учитывать, что при использовании данных в формате даты и времени у вас могут быть данные на ту же дату, но не на ту же самую секунду. А при округлении дат до недель сдвиг в годах тоже вернет `NULL`. {text:time_series_syntax}

source: ## Syntax {#syntax} Time series functions support extended syntax: {text:time_series_signature} ### BEFORE FILTER BY {#syntax-before-filter-by} If any fields are listed in `BEFORE FILTER BY`, then the function is calculated before data is filtered using these fields. Let's say you are trying to calculate the value of `[Sales]` a year ago from today's date: ``` AGO([Sales], [Date], "year", 1) ``` and also have a filter in the chart limiting the dates to a specific year (`2018 < [Year] <= 2019`, where `Year` is calculated as `YEAR([Date])`). All data pertaining to the year 2018 will be omitted from the result. Because of this the function will return `NULL`. If `BEFORE FILTER BY` is added to the function: ``` AGO([Sales], [Date], "year", 1 BEFORE FILTER BY [Year]) ``` it will return the value of `[Sales]`. The date/time dimension specified as the second argument of time series functions is implicitly added to the `BEFORE FILTER BY` clause. For example, the following to formulas are equivalent: ``` AGO([Sales], [Date], "week") ``` ``` AGO([Sales], [Date], "week" BEFORE FILTER BY [Date]) ``` ### IGNORE DIMENSIONS {#syntax-ignore-dimensions} The `IGNORE DIMENSIONS` clause allows the exclusion of dimensions from the search criteria. When looking up a value for a certain date, the search is done by matching dimension values in each row against the values of the same dimensions in the original row. If any of the other dimensions correlate with the date dimension, then the data query may return an empty result (`NULL`). For example, if the data request contains `[Date]`, `[Month]` and `AGO([Sales], [Date], "month")`, then it will be impossible to find a row with `[Date]` being a month earlier, but the value of `[Month]` being the same as in the current row. This will result in `AGO` always returning `NULL`. To get the correct value of `[Sales]` exclude `[Month]` using the `IGNORE DIMENSIONS` clause: ``` AGO([Sales], [Date], "month" IGNORE DIMENSIONS [Month]) ```
ru: ## Синтаксис {#syntax} Функции временных рядов поддерживают расширенный синтаксис: {text:time_series_signature} ### BEFORE FILTER BY {#syntax-before-filter-by} Если какие-то поля перечислены в `BEFORE FILTER BY`, то функция вычисляется до применения фильтрации по этим полям. Например, если c помощью функции {ref:AGO} рассчитать `[Sales]` за период (год назад) от текущей даты: ``` AGO([Sales], [Date], "year", 1) ``` и при этом в чарте используется фильтр, ограничивающий даты одним годом (`2018 < [Year] <= 2019`, где `Year` равно `YEAR([Date])`), то все строки, относящиеся к 2018 году, будут исключены из запроса. В результате функция вернет `NULL`. Если в формулу с `AGO` добавить `BEFORE FILTER BY`: ``` AGO([Sales], [Date], "year", 1 BEFORE FILTER BY [Year]) ``` то функция вернет значение `[Sales]`. Временное измерение, заданное вторым аргументом функций временных рядов, автоматически добавляется в `BEFORE FILTER BY`. Таким образом, следующие две формулы эквивалентны: ``` AGO([Sales], [Date], "week") ``` ``` AGO([Sales], [Date], "week" BEFORE FILTER BY [Date]) ``` ### IGNORE DIMENSIONS {#syntax-ignore-dimensions} `IGNORE DIMENSIONS` позволяет исключить измерения из критериев поиска. Для вычисления значения показателя для какой-то даты поиск нужной строки производится с помощью построчного сопоставления значений всех измерений со значениями этих же измерений в текущей строке. Если какие-либо измерения косвенно или напрямую зависят от даты, то запрос может вернуть пустые значения (`NULL`). Например, если делается запрос с полями `[Date]`, `[Month]` (месяц от даты) и `AGO([Sales], [Date], "month")`, то будет невозможно найти строку, в которой значение `[Date]` на месяц меньше текущего, а значение `[Month]` совпадает со значением в текущей строке. Из-за этого результатом `AGO` будет `NULL` во всех строках. Чтобы функция вернула правильное значение `[Sales]`, с помощью `IGNORE DIMENSIONS` исключите измерение `[Month]`: ``` AGO([Sales], [Date], "month" IGNORE DIMENSIONS [Month]) ```

source: https://en.wikipedia.org/wiki/Unix_time
ru: https://ru.wikipedia.org/wiki/Unix-время
