Repository: datalens-tech/datalens-backend
Catalog: lib/dl_formula_ref/dl_formula_ref/locales/*/LC_MESSAGES/dl_formula_ref_dl_formula_ref.po
Languages: ru

source: Returns the rank of the current row if ordered by the given argument. Rows corresponding to the same value used for sorting have the same rank. If the first two rows both have rank of `1`, then the next row (if it features a different value) will have rank `3`, so, in effect, it is rank with gaps. {text:rank_direction_description} See also {ref: RANK_DENSE}, {ref: RANK_UNIQUE}, {ref:RANK_PERCENTILE}.
ru: Выполняет ранжирование значений с пропусками: возвращает порядковый номер строки при сортировке по {arg:0}. Строки, которые соответствуют одному и тому же значению {arg:0}, имеют одно и то же значение ранга. Если первые две строки получают ранг `1`, то ранг следующей строки (если значение {arg:0} не совпадает) будет равен `3`. Значение `2` в этом случае пропускается. {text:rank_direction_description} См. также {ref: RANK_DENSE}, {ref: RANK_UNIQUE}, {ref: RANK_PERCENTILE}.

source: Returns the rank of the current row if ordered by the given argument. Rows corresponding to the same value used for sorting have the same rank. If the first two rows both have rank of `1`, then the next row (if it features a different value) will have rank `2`, (rank without gaps). {text:rank_direction_description} See also {ref: RANK}, {ref: RANK_UNIQUE}, {ref:RANK_PERCENTILE}.
ru: Выполняет ранжирование значений без пропусков: возвращает порядковый номер строки при сортировке по {arg:0}. Строки, которые соответствуют одному и тому же значению {arg:0}, имеют одно и то же значение ранга. Если первые две строки получают ранг `1`, то ранг следующей строки (если значение {arg:0} не совпадает) будет равен `2`. Значения ранга не пропускаются. {text:rank_direction_description} См. также {ref: RANK}, {ref: RANK_DENSE}, {ref: RANK_PERCENTILE}.

source: Returns the rank of the current row if ordered by the given argument. Rows corresponding to the same value have different rank values. This means that rank values are sequential and different for all rows, always increasing by `1` for the next row. {text:rank_direction_description} See also {ref: RANK}, {ref: RANK_DENSE}, {ref:RANK_PERCENTILE}.
ru: Выполняет уникальное ранжирование. Возвращает порядковый номер строки при сортировке по {arg:0}. Строки, которые соответствуют одному и тому же значению {arg:0}, имеют разные значения ранга. Ни для каких двух строк значения не совпадают. Принимает все значения от `1` до значения, которое равно количеству строк. {text:rank_direction_description} См. также {ref: RANK}, {ref: RANK_DENSE}, {ref: RANK_PERCENTILE}.

source: Returns the relative rank (from `0` to `1`) of the current row if ordered by the given argument. Calculated as `(RANK(...) - 1) / (row count) `. {text:rank_direction_description} See also {ref: RANK}, {ref: RANK_DENSE}, {ref: RANK_UNIQUE}.
ru: Выполняет относительное ранжирование. Возвращает дробный ранг (от `0` до `1`). Расчитывается как `(RANK(...) - 1) / (количество строк)`. {text:rank_direction_description} См. также {ref: RANK}, {ref: RANK_DENSE}, {ref: RANK_UNIQUE}.

source: Returns the number of items in the specified window.
ru: Возвращает количество элементов в заданном окне.

source: Returns the average of all values. Applicable to numeric data types.
ru: Возвращает среднее арифметическое значений выражения. Работает только с числовыми типами данных.

source: Returns the number of items in the specified window meeting the {arg:0} condition.
ru: Возвращает количество элементов в заданном окне, которые удовлетворяют условию {arg:0}.

source: Example with ORDER BY
ru: Пример с ORDER BY

source: The sorting order is based on the fields listed in the sorting section of the chart and in the `ORDER BY` clause. First, `ORDER BY` fields are used, and then they are complemented by the fields from the chart.
ru: Сортировка осуществляется на основе полей, перечисленных в области сортировки в чарте и в ORDER BY. При этом сначала берутся поля из `ORDER BY`.

source: Window
ru: Окно

source: Starts from the first row and ends at the current row.
ru: От первой записи до текущей.

source: Starts from the current row and ends at the last row.
ru: От текущей записи до последней.

source: {table:rwindow_description_table} By default `"asc"` is used.
ru: {table:rwindow_description_table} По умолчанию используется значение `"asc"`.

source: Returns the sum of all values in a growing (or shrinking) window defined by the sort order and the value of {arg:1}: {text:rwindow_description} Window functions with a similar behavior: {ref:RCOUNT}, {ref:RMIN}, {ref:RMAX}, {ref:RAVG}. See also {ref:aggregation/SUM}, {ref:MSUM}.
ru: Возвращает сумму значений в рамках окна записей, определяемого порядком сортировки и значением аргумента {arg:1}: {text:rwindow_description} Аналогичное поведение у оконных функций {ref:RCOUNT}, {ref:RMIN}, {ref:RMAX}, {ref:RAVG}. См. также {ref:aggregation/SUM}, {ref:MSUM}.

source: Returns the count of all values in a growing (or shrinking) window defined by the sort order and the value of {arg:1}: {text:rwindow_description} Window functions with a similar behavior: {ref:RSUM}, {ref:RMIN}, {ref:RMAX}, {ref:RAVG}. See also {ref:aggregation/COUNT}, {ref:MCOUNT}.
ru: Возвращает количество значений в рамках окна записей, определяемого порядком сортировки и значением аргумента {arg:1}: {text:rwindow_description} Аналогичное поведение у оконных функций {ref:RSUM}, {ref:RMIN}, {ref:RMAX}, {ref:RAVG}. См. также {ref:aggregation/COUNT}, {ref:MCOUNT}.

source: Returns the minimum of all values in a growing (or shrinking) window defined by the sort order and the value of {arg:1}: {text:rwindow_description} Window functions with a similar behavior: {ref:RSUM}, {ref:RCOUNT}, {ref:RMAX}, {ref:RAVG}. See also {ref:aggregation/MIN}, {ref:MMIN}.
ru: Возвращает минимальное из значений в рамках окна записей, определяемого порядком сортировки и значением аргумента {arg:1}: {text:rwindow_description} Аналогичное поведение у оконных функций {ref:RSUM}, {ref:RCOUNT}, {ref:RMAX}, {ref:RAVG}. См. также {ref:aggregation/MIN}, {ref:MMIN}.

source: Returns the maximum of all values in a growing (or shrinking) window defined by the sort order and the value of {arg:1}: {text:rwindow_description} Window functions with a similar behavior: {ref:RSUM}, {ref:RCOUNT}, {ref:RMIN}, {ref:RAVG}. See also {ref:aggregation/MAX}, {ref:MMAX}.
ru: Возвращает максимальное из значений в рамках окна записей, определяемого порядком сортировки и значением аргумента {arg:1}: {text:rwindow_description} Аналогичное поведение у оконных функций {ref:RSUM}, {ref:RCOUNT}, {ref:RMIN}, {ref:RAVG}. См. также {ref:aggregation/MAX}, {ref:MMAX}.

source: Returns the average of all values in a growing (or shrinking) window defined by the sort order and the value of {arg:1}: {text:rwindow_description} Window functions with a similar behavior: {ref:RSUM}, {ref:RCOUNT}, {ref:RMIN}, {ref:RMAX}. See also {ref:aggregation/AVG}, {ref:MAVG}.
ru: Возвращает среднее арифметическое значений в рамках окна записей, определяемого аргументом {arg:1}: {text:rwindow_description} Аналогичное поведение у оконных функций {ref:RSUM}, {ref:RCOUNT}, {ref:RMIN}, {ref:RMAX}. См. также {ref:aggregation/AVG}, {ref:MAVG}.

source: Example with two and three arguments
ru: Пример с двумя и тремя аргументами

source: positive
ru: положительное

source: The current row and {arg:1} preceding rows.
ru: Текущая запись и {arg:1} предшествующих.

source: negative
ru: отрицательное

source: The current row and -{arg:1} following rows.
ru: Текущая запись и -{arg:1} последующих.

source: any sign
ru: любой знак

source: {arg:1} preceding rows, the current row and {arg:2} following rows.
ru: {arg:1} предшествующих записей, текущая и {arg:2} последующих.

source: Returns the moving sum of values in a fixed-size window defined by the sort order and arguments: {text:mwindow_description} Window functions with a similar behavior: {ref:MCOUNT}, {ref:MMIN}, {ref:MMAX}, {ref:MAVG}. See also {ref:aggregation/SUM}, {ref:RSUM}.
ru: Возвращает скользящую сумму значений по окну записей, которое определяется порядком сортировки и аргументами: {text:mwindow_description} Аналогичное поведение у оконных функций {ref:MCOUNT}, {ref:MMIN}, {ref:MMAX}, {ref:MAVG}. См. также {ref:aggregation/SUM}, {ref:RSUM}.

source: Returns the moving count of (non-`NULL`) values in a fixed-size window defined by the sort order and arguments: {text:mwindow_description} Window functions with a similar behavior: {ref:MSUM}, {ref:MMIN}, {ref:MMAX}, {ref:MAVG}. See also {ref:aggregation/COUNT}, {ref:RCOUNT}.
ru: Возвращает количество значений (не равных `NULL`) по окну записей, которое определяется порядком сортировки и аргументами: {text:mwindow_description} Аналогичное поведение у оконных функций {ref:MSUM}, {ref:MMIN}, {ref:MMAX}, {ref:MAVG}. См. также {ref:aggregation/COUNT}, {ref:RCOUNT}.

source: Returns the moving minimum of values in a fixed-size window defined by the sort order and arguments: {text:mwindow_description} Window functions with a similar behavior: {ref:MSUM}, {ref:MCOUNT}, {ref:MMAX}, {ref:MAVG}. See also {ref:aggregation/MIN}, {ref:RMIN}.
ru: Возвращает скользящий минимум значений по окну записей, определяемому порядком сортировки и аргументами: {text:mwindow_description} Аналогичное поведение у оконных функций {ref:MSUM}, {ref:MCOUNT}, {ref:MMAX}, {ref:MAVG}. См. также {ref:aggregation/MIN}, {ref:RMIN}.

source: Returns the moving maximum of values in a fixed-size window defined by the sort order and arguments: {text:mwindow_description} Window functions with a similar behavior: {ref:MSUM}, {ref:MCOUNT}, {ref:MMIN}, {ref:MAVG}. See also {ref:aggregation/MAX}, {ref:RMAX}.
ru: Возвращает скользящий максимум значений по окну записей. Значение определяется порядком сортировки и аргументами: {text:mwindow_description} Аналогичное поведение у оконных функций {ref:MSUM}, {ref:MCOUNT}, {ref:MMIN}, {ref:MAVG}. См. также {ref:aggregation/MAX}, {ref:RMAX}.

source: Returns the moving average of values in a fixed-size window defined by the sort order and arguments: {text:mwindow_description} Window functions with a similar behavior: {ref:MSUM}, {ref:MCOUNT}, {ref:MMIN}, {ref:MMAX}. See also {ref:aggregation/AVG}, {ref:RAVG}.
ru: Возвращает скользящее среднее значений по окну записей. Значение определяется порядком сортировки и аргументами: {text:mwindow_description} Аналогичное поведение у оконных функций {ref:MSUM}, {ref:MCOUNT}, {ref:MMIN}, {ref:MMAX}. См. также {ref:aggregation/AVG}, {ref:RAVG}.

source: Example with the optional argument
ru: Пример опциональным аргументом

source: Returns {arg:0} re-evaluated against the row that is offset from the current row by {arg:1} within the specified window: - Positive {arg:1} seeks among preceding rows. - Negative {arg:1} seeks among following rows. By default {arg:1} is `1`. If there is no available value ({arg:1} reaches before the first row or after the last one), then {arg:2} is returned. If {arg:2} is not specified, then `NULL` is used. See also {ref:AGO} for a non-window function alternative.
ru: Возвращает значение {arg:0} из строки со смещением {arg:1} относительно текущей в рамках заданного окна: - положительное значение {arg:1} делает смещение назад; - отрицательное значение {arg:1} делает смещение вперед. По умолчанию {arg:1} равно `1`. Если значение отсутствует ({arg:1} ссылается на строку до первой или после последней), то возвращается значение {arg:2} в качестве результата. Если {arg:2} не задано, то используется `NULL`. См. также {ref:AGO} в качестве неоконной альтернативы.

source: Returns the value of {arg:0} from the first row in the window. See also {ref:LAST}.
ru: Возвращает значение {arg:0} из первой строки заданного окна. См. также {ref:LAST}.

source: Returns the value of {arg:0} from the last row in the window. See also {ref:FIRST}.
ru: Возвращает значение {arg:0} из последней строки заданного окна. См. также {ref:FIRST}.

source: Function availability for various data source types.
ru: Ниже приведена информация о поддержке функций различными источниками.

source: Source data
ru: Исходные данные

source: Grouped by
ru: Группировка по

source: Sorted by
ru: Сортировка по

source: Formulas
ru: Формулы

source: Result
ru: Результат

source: Syntax
ru: Синтаксис

source: Description
ru: Описание

source: Argument types
ru: Типы аргументов

source: Return type
ru: Возвращаемый тип

source: Examples
ru: Примеры

source: Data source support
ru: Поддержка источников данных

source: <br/>or<br/>
ru: <br/>или<br/>
