Repository: datalens-tech/datalens-backend
Catalog: lib/dl_formula_ref/dl_formula_ref/locales/*/LC_MESSAGES/dl_formula_ref_dl_formula_ref.po
Languages: ru

source: Returns the element with the index {arg:1} from the array {arg:0}. Index must be any integer. Indexes in an array begin with one. Returns the last item from the array if {arg:1} is `-1`.
ru: Возвращает элемент с индексом {arg:1} из массива {arg:0}. Индекс должен быть целым числом. Индексы в массиве начинаются с единицы. Возвращает последний элемент из массива, если значение {arg:1} равно `-1`.

source: Concatenates elements of the array {arg:0} using {arg:1} as a delimiter (comma by default) and {arg:2} as a `NULL` string (`NULL` items are skipped by default). See also {ref:STR}
ru: Из элементов массива {arg:0} формирует строку, используя {arg:1} в качестве разделителя (запятая по умолчанию) и {arg:2} в качестве строки, подставляемой вместо `NULL` (по умолчанию такие элементы пропускаются и в результат не попадают). См. также {ref:STR}

source: Returns the number of elements in the array {arg:0} equal to {arg:1}. The type of {arg:1} must match the type of the {arg:0} elements.
ru: Возвращает количество элементов массива {arg:0}, равных {arg:1}. Тип {arg:1} должен соответствовать типу элементов {arg:0}.

source: Returns `TRUE` if {arg:0} contains {arg:1}.
ru: Возвращает `TRUE`, если {arg:0} содержит {arg:1}.

source: Returns `TRUE` if {arg:0} contains all elements of {arg:1}.
ru: Возвращает `TRUE`, если {arg:0} содержит все элементы {arg:1}.

source: Returns `TRUE` if {arg:0} contains any elements of {arg:1}.
ru: Возвращает `TRUE`, если {arg:0} содержит хотя бы один элемент из {arg:1}.

source: Returns `TRUE` if {arg:1} is a continuous subsequence of {arg:0}. In other words, returns `TRUE` if and only if `array1 = prefix + array2 + suffix`.
ru: Возвращает `TRUE`, если {arg:1} является непрерывной подпоследовательностью {arg:0}. Другими словами, возвращает `TRUE` исключительно если `array1 = prefix + array2 + suffix`.

source: Returns `TRUE` if {arg:0} starts with {arg:1}.
ru: Возвращает `TRUE`, если значения из массива {arg:1} находятся в начале массива {arg:0}.

source: Returns the part of array {arg:0} of length {arg:2} starting from index {arg:1}. Indexes in an array begin with one.
ru: Возвращает часть массива {arg:0} длины {arg:2}, начиная с индекса {arg:1}. Индексы в массиве начинаются с единицы.

source: Converts {arg:0} to an array of integers. The conversion rules are the same as for {ref:INT}.
ru: Приводит массив {arg:0} к массиву целых чисел. Правила преобразования аналогичны функции {ref:INT}.

source: Converts {arg:0} to an array of strings. The conversion rules are the same as for {ref:STR}.
ru: Приводит массив {arg:0} к массиву строк. Правила преобразования аналогичны функции {ref:STR}.

source: Converts {arg:0} to an array of fractional numbers. The conversion rules are the same as for {ref:FLOAT}.
ru: Приводит массив {arg:0} к массиву дробных значений. Правила преобразования аналогичны функции {ref:FLOAT}.

source: Replaces each {arg:0} element equal to {arg:1} with {arg:2}.
ru: Заменяет в массиве {arg:0} все элементы, равные {arg:1}, на {arg:2}.

source: This function cannot work with arrays with `Nullable` items. To remove `NULL` items from the array, use {ref:ARR_REMOVE} or {ref:array/REPLACE}.
ru: Функция не работает для массивов с `Nullable` элементами. Чтобы удалить из массива элементы, равные `NULL`, используйте {ref:ARR_REMOVE} или {ref:array/REPLACE}.

source: Returns the least of elements in the {arg:0}.
ru: Возвращает значение минимального элемента в массиве {arg:0}.

source: Returns the greatest of elements in the {arg:0}.
ru: Возвращает значение максимального элемента в массиве {arg:0}.

source: Returns the sum of elements in the {arg:0}.
ru: Возвращает сумму элементов в массиве {arg:0}.

source: Returns the average of elements in the {arg:0}.
ru: Возвращает среднее значение элементов в массиве {arg:0}.

source: Returns the product of elements in the {arg:0}.
ru: Возвращает произведение элементов массива {arg:0}.

source: Removes all {arg:0} elements equal to {arg:1}.
ru: Удаляет из массива {arg:0} все элементы, равные {arg:1}.

source: Returns an array of elements that occur in every array provided as an argument. The function does not put such elements in any particular order. Duplicate elements are only added once.
ru: Возвращает массив элементов, которые встречаются в каждом из переданных в качестве аргументов массивов. В массиве с результатом работы функции элементы расположены в произвольном порядке. Повторяющиеся элементы добавляются только в одном экземпляре.

source: Returns the number of the {arg:0} items.
ru: Возвращает количество элементов в массиве {arg:0}.

source: Returns the date obtained by adding {arg:1} in the amount of {arg:2} to the specified date {arg:0}. The {arg:2} argument is an integer. It can be negative. The {arg:1} argument takes the following values: - `"year"`; - `"month"`; - `"day"`; - `"hour"`; - `"minute"`; - `"second"`.
ru: Возвращает дату, полученную в результате добавления {arg:1} в количестве {arg:2} к указанной дате {arg:0}. Аргумент {arg:2} задается целым числом. Может принимать отрицательные значения. Аргумент {arg:1} принимает следующие значения: - `"year"` — год; - `"month"` — месяц; - `"day"` — день; - `"hour"` — час; - `"minute"` — минута; - `"second"` — секунда.

source: For all sources except {dialects:CLICKHOUSE}, {arg:2} takes only constant values.
ru: Для всех источников, кроме {dialects:CLICKHOUSE}, аргумент {arg:2} принимает только константные значения.

source: Returns a part of the date as an integer. Depending on the argument, {arg:1} returns the following values: - `"year"` — the year number (see {ref:YEAR}); - `"quarter"` — the number of the quarter (from `1` to `4`) of the year (see {ref:QUARTER}); - `"month"` — the number of the month in the year (see {ref:MONTH}); - `"week"` — the number of the week in the year according to {link: iso_8601: ISO 8601} (see {ref:WEEK}); - `"dayofweek"`, `"dow"` — the number of the day of the week (see {ref:DAYOFWEEK}); - `"day"` — the number of the day in the month (see {ref:DAY}); - `"hour"` — the number of the hour in the day (see {ref:HOUR}); - `"minute"` — the number of the minute in the hour (see {ref:MINUTE}); - `"second"` — the number of the second in the minute (see {ref:SECOND}). If you select `"dayofweek"`, you can use the additional parameter {arg:2} to specify the first day of the week (Monday by default). Learn more about this parameter in the {ref:DAYOFWEEK} function description.
ru: Возвращает часть даты в виде целого числа. В зависимости от аргумента {arg:1} возвращает следующие значения: - `"year"` — номер года (см. {ref:YEAR}); - `"quarter"` — номер квартала года (от `1` до `4`) (см. {ref:QUARTER}); - `"month"` — номер месяца в году (см. {ref:MONTH}); - `"week"` — номер недели в году по {link: iso_8601: ISO 8601} (см. {ref:WEEK}); - `"dayofweek"`, `"dow"` — номер дня недели (см. {ref:DAYOFWEEK}); - `"day"` — номер дня в месяце (см. {ref:DAY}); - `"hour"` — номер часа в дне (см. {ref:HOUR}); - `"minute"` — номер минуты в часе (см. {ref:MINUTE}); - `"second"` — номер секунды в минуте (см. {ref:SECOND}). Если выбран "`dayofweek`", то дополнительным параметром {arg:2} можно задать, какой день недели считать первым — по умолчанию это понедельник. Более подробно об этом параметре смотрите в описании функции {ref:DAYOFWEEK}.

source: Example with date
ru: Пример с датой

source: Example with custom first day of the week
ru: Пример с заданным первым днем недели

source: Example with date and time
ru: Пример с датой и временем

source: Rounds {arg:0} down to the given {arg:1}. If optional {arg:2} is given, then the value is rounded down to a {arg:2} multiple of {arg:1} (omitting {arg:2} is the same as `{argn:2} = 1`). Supported units: - `"second"`; - `"minute"`; - `"hour"`; - `"day"` (acts as the day of the year if {arg:2} is specified); - `"week"`; - `"month"`; - `"quarter"`; - `"year"`. When using a function with three arguments, it is processed on the {{ CH }} side by the {link: ch_toStartOfInterval: toStartOfInterval function}. Rounding is done relative to a specific point in time, as detailed in the table in the function description. For example: ``` DATETRUNC(#2018-07-12 11:07:13#, "month", 4) = #2018-05-01 00:00:00# ``` For the `unit` argument set to `month`, rounding starts from `1900-01-01`. There are 1,422 months between `2018-07-12` and `1900-01-01`. Rounding this value to the nearest number divisible by 4 (the `number` argument), we get 1,420 months. Thus, adding 1,420 months to `1900-01-01` gives us `2018-05-01`.
ru: Возвращает дату, округленную по аргументу {arg:1}. Если задан аргумент {arg:2}, то происходит округление до этого количества временных единиц. Отсутствие аргумента эквивалентно значению `1`. Поддерживаемые значения {arg:1}: - `"second"`; - `"minute"`; - `"hour"`; - `"day"` (при заданном {arg:2} используется номер дня в году); - `"week"`; - `"month"`; - `"quarter"`; - `"year"`. При использовании функции с тремя аргументами, она обрабатывается на стороне {{ CH }} функцией {link: ch_toStartOfInterval: toStartOfInterval}. Округление выполняется относительно определенного момента времени в соответствии с приведенной в описании функции таблицей. Например: ``` DATETRUNC(#2018-07-12 11:07:13#, "month", 4) = #2018-05-01 00:00:00# ``` Для аргумента `unit` со значением `month` округление считается от даты `1900-01-01`. Между датами `2018-07-12` и `1900-01-01` прошло 1422 месяца. Если округлить это число до ближайшего числа, которое делится на 4 (аргумент `number`), то получится 1420 месяцев. Таким образом, если к дате `1900-01-01` прибавить 1420 месяцев, то получится значение `2018-05-01`.

source: Returns the number of the second in the minute of the specified date {arg:0}. When the date is specified without time, it returns `0`.
ru: Возвращает номер секунды в минуте в указанной дате {arg:0}. При указании даты без времени возвращает `0`.

source: Returns the number of the minute in the hour of the specified date {arg:0}. When the date is specified without time, it returns `0`.
ru: Возвращает номер минуты в часе в указанной дате {arg:0}. При указании даты без времени возвращает 0.

source: Returns the number of the hour in the day of the specified date and time {arg:0}. When the date is specified without time, it returns `0`.
ru: Возвращает номер часа в дне в указанной дате и времени {arg:0}. При указании даты без времени возвращает `0`.

source: Returns the number of the day in the month of the specified date {arg:0}.
ru: Возвращает номер дня в месяце в указанной дате {arg:0}.

source: Returns the number of the month in the year of the specified date {arg:0}.
ru: Возвращает номер месяца в году в указанной дате {arg:0}.

source: Returns the number of the quarter (from `1` to `4`) of the year of the specified date {arg:0}.
ru: Возвращает номер квартала года (от `1` до `4`) в указанной дате {arg:0}.

source: Returns the year number in the specified date {arg:0}.
ru: Возвращает номер года в указанной дате {arg:0}.

source: Returns the day of the week according to {link: iso_8601: ISO 8601}. - Monday — 1. - Sunday — 7. If the additional parameter {arg:1} is specified, this day is considered the first day of the week. Valid values: - `"Monday"`, `"Mon"` — Monday; - `"Tuesday"`. `"Tue"` — Tuesday; - `"Wednesday"`, `"Wed"` — Wednesday; - `"Thursday"`, `"Thu"` — Thursday; - `"Friday"`, `"Fri"` — Friday; - `"Saturday"`, ` "Sat"` — Saturday; - `"Sunday"`, `"Sun"` — Sunday.
ru: Возвращает день недели в соответствии с {link: iso_8601: ISO 8601}. - Понедельник — 1; - Воскресенье — 7. Если указан дополнительный параметр {arg:1}, то этот день считается первым в неделе. Допустимые значения: - `"Monday"`, `"Mon"` — понедельник; - `"Tuesday"`, `"Tue"` — вторник; - `"Wednesday"`, `"Wed"` — среда; - `"Thursday"`, `"Thu"` — четверг; - `"Friday"`, `"Fri"` — пятница; - `"Saturday"`, `"Sat"` — суббота; - `"Sunday"`, `"Sun"` — воскресенье.

source: The number of the week according to {link: iso_8601: ISO 8601}. The first week is the week that contains the first Thursday of the year or January 4th.
ru: Возвращает номер недели в соответствии с {link: iso_8601: ISO 8601}. Первой считается неделя, которая содержит первый четверг года и 4.01.

source: Returns the current date and time, depending on the data source and connection type.
ru: Возвращает текущую дату и время в зависимости от источника данных и типа соединения.

source: Returns the current date, depending on the data source and connection type.
ru: Возвращает текущую дату в зависимости от источника данных и типа соединения.

source: Returns `TRUE` if {arg:0} is `NULL`, otherwise returns `FALSE`. `{argn:0} IS NOT NULL` returns the opposite result.
ru: Возвращает `TRUE`, если {arg:0} является `NULL`. В противном случае возвращает `FALSE`. Вариант `{argn:0} IS NOT NULL` возвращает противоположное значение.

source: As a function
ru: Как функция

source: As an operator
ru: Как оператор

source: Returns {arg:0} if it's not `NULL`. Otherwise returns {arg:1}.
ru: Возвращает {arg:0}, если оно не `NULL`. В противном случае возвращает {arg:1}.

source: Returns `TRUE` if {arg:0} is `NaN`, otherwise returns `FALSE`.
ru: Возвращает `TRUE`, если {arg:0} является `NaN`. В противном случае возвращает `FALSE`.

source: Returns {arg:0} if it's not `NaN`. Otherwise returns {arg:1}.
ru: Возвращает {arg:0}, если оно не `NaN`. В противном случае возвращает {arg:1}.

source: Returns {arg:0} if it's not `NULL`. Otherwise returns 0.
ru: Возвращает значение выражения {arg:0}, если оно не `NULL`. В противном случае возвращает 0.

source: Compares {arg:0} to {arg:1}, {arg:3}, ... consecutively and returns the corresponding result for the first match. If no match is found, it returns {arg:5}.
ru: Сравнивает выражение {arg:0} с последовательностью значений {arg:1}, {arg:3}, ... и возвращает результат для первого совпадения. Если совпадений не найдено, то возвращает {arg:5}.

source: As a block
ru: Как блок

source: Example with data table
ru: Пример с таблицей данных

source: Checks conditional expressions {arg:0}, {arg:1}, ... and returns the matching result for the first condition found to be `TRUE`. IF all conditional expressions are `FALSE`, it returns {arg:4}. The expressions to be checked are set using logical operators.
ru: Проверяет последовательно логические выражения {arg:0}, {arg:2}, ... и возвращает соответствующий результат для первого выполнения. Если все {arg:0}, {arg:2}, ... возвращают `FALSE`, то блок возвращает {arg:4}. Проверяемые выражения задаются с помощью логических операторов.

source: Arguments {arg:1}, {arg:3}, {arg:4} must be of the same type.
ru: Тип аргументов {arg:1}, {arg:3}, {arg:4} должен совпадать.

source: Stylizes the passed text in bold font.
ru: Выделяет переданный текст жирным шрифтом.

source: Stylizes the passed text in cursive font.
ru: Выделяет переданный текст курсивом.

source: Wraps {arg:1} into a hyperlink to URL {arg:0}. When you click on the link, the page opens in a new browser tab.
ru: Оборачивает {arg:1} в ссылку на URL {arg:0}. При переходе по ссылке страница открывается в новой вкладке браузера.

source: Merges marked up text pieces. Can also be used for converting strings to marked up text.
ru: Объединяет размеченный текст. Также может быть использован для конвертации обычных строк в размеченный текст.

source: Enables specifying the color for the provided text. We recommend using the {link: gravity_ui_texts_link: color variables} from the {link: gravity_ui_link: Gravity UI} palette to specify colors. Such colors are easily discernible with both the light and dark theme. You can also specify the color in any web format, such as HEX, keyword (e.g., `green`), RGB, etc. In this case, however, we cannot guarantee that the colors will be discernible.
ru: Позволяет указать цвет для переданного текста. Рекомендуем использовать для указания цветов {link: gravity_ui_texts_link: переменные} из палитры дизайн-системы {link: gravity_ui_link: Gravity UI}. Эти цвета будут хорошо различимы как в светлой, так и в темной теме. Также цвет можно указать в любом формате представления веб-цвета: HEX, ключевым словом (например, `green`), RGB и т. д. Но в этом случае мы не гарантируем различимость цветов.

source: Enables specifying the size (in pixels) for the provided text.
ru: Позволяет указать размер в пикселях для переданного текста.

source: Adds a line break.
ru: Добавляет перенос строки.

source: Enables inserting an image located at the {arg:0} address to the table. The {arg:1} and {arg:2} values are provided in pixels. If one of the dimensions is `NULL`, it will be calculated automatically in proportion to the other. If both dimensions are `NULL`, the image will be inserted with the original width and height. In case there are issues when uploading the image, the function will display the {arg:3} text. {text: image_source_restrictions}
ru: Позволяет вставить в таблицу изображение, расположенное по адресу {arg:0}. Ширина ({arg:1}) и высота ({arg:2}) изображения указываются в пикселях. Если для одного из размеров указано значение `NULL`, он рассчитывается автоматически пропорционально размеру другой стороны. Если для обоих размеров указано значение `NULL`, изображение вставляется с исходными размерами. В случае проблем с загрузкой изображения функция выводит альтернативный текст {arg:3}. {text: image_source_restrictions}

source: Returns the marked up text by {arg:0} to display username or email depending on the {arg:1} value: * `email`: Returns email. * `name`: Returns name. If the user has not been found, the function will return the original string from the source.
ru: По идентификатору пользователя {arg:0} возвращает размеченный текст для отображения его имени или email в зависимости от значения второго аргумента {arg:1}: * `email` — возвращает email; * `name` — возвращает имя. Если пользователь не найден, возвращается оригинальная строка из источника.

source: Adds a small tooltip to a text or other markup function results. The {arg:2} argument manages the text positioning: `top`, `right`, `bottom`, `left` or `auto`. The default value is `auto`.
ru: Добавляет небольшую всплывающую подсказку к тексту или результату выполнения других функций разметки. Аргумент {arg:2} отвечает за расположение подсказки (`top`, `right`, `bottom`, `left` или `auto`). Значение по умолчанию — `auto`.

source: Returns the absolute value of {arg:0}.
ru: Возвращает абсолютное значение заданного числа {arg:0}.

source: Returns the arccosine of {arg:0} in radians.
ru: Возвращает выраженный в радианах арккосинус числа {arg:0}.

source: Returns the arcsine of {arg:0} in radians.
ru: Возвращает выраженный в радианах арксинус числа {arg:0}.

source: Returns the arctangent of {arg:0} in radians.
ru: Возвращает выраженный в радианах арктангенс числа {arg:0}.

source: Returns the arctangent in radians for the specified coordinates {arg:0} and {arg:1}.
ru: Возвращает выраженный в радианах арктангенс для заданных координат {arg:0} и {arg:1}.

source: Rounds the value up to the nearest integer.
ru: Округляет значение до ближайшего целого числа в большую сторону.

source: Rounds the value down to the nearest integer.
ru: Округляет значение до ближайшего целого числа в меньшую сторону.

source: Returns the cosine of {arg:0} in radians.
ru: Возвращает косинус числа {arg:0}, заданного в радианах.

source: Returns the cotangent of {arg:0} in radians.
ru: Возвращает котангенс числа {arg:0}, заданного в радианах.

source: Converts radians to degrees.
ru: Преобразует радианы в градусы.

source: Divides {arg:0} by {arg:1}. The result is rounded down to the nearest integer.
ru: Возвращает результат деления {arg:0} на {arg:1}. Результат будет округлен до целого числа.

source: Divides {arg:0} by {arg:1}. Returns {arg:2} if division by zero occurs. If the number {arg:2} is omitted, it is assumed to be `NULL`. The result is rounded down to the nearest integer.
ru: Возвращает результат деления {arg:0} на {arg:1}. В случае деления на ноль возвращает {arg:2}. Если число {arg:2} не указано, возвращает `NULL`. Результат будет округлен до целого числа.

source: Divides {arg:0} by {arg:1}. Returns {arg:2} if division by zero occurs. If the number {arg:2} is omitted, it is assumed to be `NULL`.
ru: Возвращает результат деления {arg:0} на {arg:1}. В случае деления на ноль возвращает {arg:2}. Если число {arg:2} не указано, возвращает `NULL`.

source: Returns the result of raising the number 'e' to the power of {arg:0}.
ru: Возвращает результата возведения числа `e` в степень {arg:0}.

source: Returns the natural logarithm of the number {arg:0}. Returns `NULL` if the number is less than or equal to 0.
ru: Возвращает натуральный логарифм числа {arg:0}. Возвращает `NULL`, если число меньше или равно 0.

source: Returns the logarithm of the number {arg:0} to base 10. Returns `NULL` if the number is less than or equal to 0.
ru: Возвращает логарифм числа {arg:0} по основанию 10. Возвращает `NULL`, если число меньше или равно 0.

source: Returns the logarithm of {arg:0} to base {arg:1}. Returns `NULL` if the number {arg:0} is less than or equal to 0.
ru: Возвращает логарифм числа {arg:0} по основанию числа {arg:1}. Возвращает `NULL`, если число {arg:0} меньше или равно 0.

source: Returns the greatest value. See also {ref:LEAST}. Depending on the specified data type, it returns: - The greatest number. - The last string in alphabetical order. - The latest date. - `TRUE` when selecting between `TRUE` and `FALSE` for Boolean type.
ru: Возвращает наибольшее из значений. См. также {ref:LEAST}. В зависимости от указанного типа данных, возвращает: - наибольшее число; - последнюю строку в алфавитном порядке; - позднюю дату; - `TRUE` при выборе из `TRUE` и `FALSE` для логического типа.

source: Returns the smallest value. See also {ref:GREATEST}. Depending on the specified data type, it returns: - The smallest number. - The first string in alphabetical order. - The earliest date. - `FALSE` when selecting between `TRUE` and `FALSE` for Boolean type.
ru: Возвращает наименьшее из значений. См. также {ref:GREATEST}. В зависимости от указанного типа данных, возвращает: - наименьшее число; - первую строку в алфавитном порядке; - раннюю дату; - `FALSE` при выборе из `TRUE` и `FALSE` для логического типа.

source: Returns PI. The accuracy depends on the data source.
ru: Возвращает число Пи. Точность зависит от источника данных.

source: Raises {arg:0} to the power of {arg:1}.
ru: Возводит число {arg:0} в степень {arg:1}.

source: Converts {arg:0} degrees to radians.
ru: Преобразует градусы {arg:0} в радианы.

source: Rounds the number {arg:0} to the number of decimal digits specified in {arg:1}. If the number {arg:1} is omitted, {arg:0} is rounded to the nearest integer.
ru: Округляет число {arg:0} до указанного числа знаков {arg:1} после запятой. Если число {arg:1} не указано, то {arg:0} округляется до ближайшего целого.

source: Returns the sign of the number {arg:0}: - `-1` if the number is negative. `0` if the number is zero. - `1` if the number is positive.
ru: Возвращает знак числа {arg:0}: - `-1` если число отрицательное; - `0` если число равно нулю; - `1` если число положительное.

source: Returns the sine of {arg:0} in radians.
ru: Возвращает синус числа {arg:0}, заданного в радианах.

source: Returns the square root of the specified number.
ru: Возвращает квадратный корень заданного числа.

source: Returns the number {arg:0} raised to the power of 2.
ru: Возвращает число {arg:0}, возведенное в степень 2.

source: Returns the tangent of {arg:0} in radians.
ru: Возвращает тангенс числа {arg:0}, заданного в радианах.
