Repository: datalens-tech/datalens-backend
Catalog: lib/dl_formula_ref/dl_formula_ref/locales/*/LC_MESSAGES/dl_formula_ref_dl_formula_ref.po
Languages: ru

source: Window functions in {{ datalens-short-name }} are calculated as aggregate functions of measures. At the same time, grouping by dimensions differs from the grouping set in the chart. Grouping parameters are specified in the function call as a list of dimensions to be included in the grouping (`WITHIN ...`) or excluded from it (`AMONG ...`). Given that measures are aggregated values, one may consider window functions in {{ datalens-short-name }} as aggregations of aggregations. One should note that not all aggregate functions would have the result of aggregating particular results that is identical to the general aggregation of values. For example, when calculating the sum of a measure for each group and then adding these values together, you will get the total sum of the measure in all groups: ``` SUM(SUM(a) UNION SUM(b)) = SUM(a UNION b) ``` When counting the amount of measure values for each group and then trying to calculate the amount from the sum of these values, you will get the amount of amounts (summands in the sum) rather than the total amount of values in all groups: ``` COUNT(COUNT(a) UNION COUNT(b)) = 2 ``` **Example** {table:win_functions_example} Where: * **Sales**: Sum of the sales measure in the categories * **Order Count**: Amount of the order measure values in the categories * **Sales_Furniture+Technology**: Total sum of the sales measure in all categories: ``` SUM_IF([Sales], [Category] = 'Furniture' TOTAL) + SUM_IF([Sales], [Category] = 'Technology' TOTAL) ``` * **OrderCount_Furniture+Technology**: Amount of amounts of the order measure values: ``` COUNT(COUNT_IF([Order Count], [Category] = 'Furniture' TOTAL) + COUNT_IF([Order Count], [Category] = 'Technology' TOTAL) TOTAL) ``` {text:window_usage_restrictions} {text:window_syntax} {text:agg_as_window} {text:window_examples}
ru: Оконные функции в {{ datalens-short-name }} вычисляются как агрегатные функции от показателей. Группировка по измерениям при этом отличается от группировки, заданной в чарте. Параметры группировки указываются при вызове функции в виде списка измерений, которые включаются в группировку (`WITHIN ...`) или исключаются из нее (`AMONG ...`). Так как показатели — это измерения, к которым применяется агрегация, то оконные функции в {{ datalens-short-name }} можно рассматривать как агрегации агрегаций. Следует учитывать, что не для всех агрегатных функций результат агрегации частных результатов идентичен общей агрегации значений. Например, если посчитать сумму для каждой группы, а затем сложить эти значения, то получится общая сумма во всех группах: ``` SUM(SUM(a) UNION SUM(b)) = SUM(a UNION b) ``` Если посчитать количество значений для каждой группы, а затем попробуете посчитать количество от суммы этих значений, то получится количество количеств (слагаемых в сумме), а не общее количество значений во всех группах: ``` COUNT(COUNT(a) UNION COUNT(b)) = 2 ``` **Пример** {table:win_functions_example} Где: * **Sales** — показатель суммы продаж в категориях; * **Order Count** — показатель количества заказов в категориях; * **Sales_Furniture+Technology** — общая сумма продаж во всех категориях: ``` SUM_IF([Sales], [Category] = 'Furniture' TOTAL) + SUM_IF([Sales], [Category] = 'Technology' TOTAL) ``` * **OrderCount_Furniture+Technology** — количество значений показателя заказов: ``` COUNT(COUNT_IF([Order Count], [Category] = 'Furniture' TOTAL) + COUNT_IF([Order Count], [Category] = 'Technology' TOTAL) TOTAL) ``` {text:window_usage_restrictions} {text:window_syntax} {text:agg_as_window} {text:window_examples}

source: ## Usage Restrictions {#usage-restrictions} 1. The first argument in window functions can only be {link:field_concept_link:measures}. For the `AVG_IF`, `COUNT_IF`, `SUM_IF` window functions, the first argument (`expression` in the function description) must always be a measure. Example: `AVG_IF([Profit], [Profit] > 5)` For other window functions, the first (and only) argument (`value` in the function description) must always be a measure, too. Examples: * Correct formula: `SUM(SUM([Profit]) TOTAL)`. * Incorrect formula: `RANK([Profit] TOTAL)`, where `[Profit]` is a non-aggregated expression. 1. For grouping window functions, only the {link:field_concept_link:dimensions} used to build the chart can be applied. Only the dimensions used to build the chart set the {link:chart_aggregation_link:grouping when calculating a measure}. These dimensions define how values are split into groups and therefore have fixed values in each group. If you specify a dimension that was not used to build the chart, it won't have a fixed value and the value can be different in each group row. As a result, it will be impossible to determine which value of this dimension must be used to calculate the measure. This limitation applies to the `WITHIN` and `AMONG` grouping types. Examples: * Correct formula: `RANK(SUM([Profit]) WITHIN [Category])` in the chart with grouping by the `[Order Date]` and `[Category]` dimensions. `[Category]` is used when building the chart. * Correct formula: `RANK(SUM([Profit]) WITHIN [Category])` in the chart with grouping by the `[Order Date]` and `[City]` dimensions. `[Category]` is not part of the grouping, so it will not be used in the calculation. The result will be the same as when using the `RANK(SUM([Profit]) TOTAL)` formula. * Incorrect formula: `RANK(SUM([Profit]) AMONG [City])` in the chart with grouping by the `[Order Date]` and `[Category]` dimensions. Running the function will return the {link: unknown_win_dimension: Unknown dimension for window} error. 1. Window functions do not support managing the {link: lod_link: level of detail}. This is only available for aggregate functions. 1. For functions that depend on sorting order, the fields listed in `ORDER BY` must be used when building the chart. 1. If a window function is used to build a **Table** chart, we don't recommend enabling the display of **Total** in the settings. This may cause an error.
ru: ## Ограничения использования {#usage-restrictions} 1. Оконные функции могут иметь в качестве первого аргумента только {link:field_concept_link:показатели}. Для оконных функций `AVG_IF`, `COUNT_IF`, `SUM_IF` первым аргументом (`expression` в описании функции) всегда должен быть показатель. **Пример:** `AVG_IF([Profit], [Profit] > 5)` Для остальных оконных функций первым (или единственным) аргументом (`value` в описании функции) также всегда должен быть показатель. **Примеры:** * Корректная формула: `SUM(SUM([Profit]) TOTAL)`. * Некорректная формула: `RANK([Profit] TOTAL)`, где `[Profit]` — неагрегированное выражение. 1. В группировке оконных функций могут использоваться только {link:field_concept_link:измерения}, участвующие в построении чарта. Только измерения, участвующие в построении чарта, задают {link:chart_aggregation_link:группировку при вычислении показателя}. Эти измерения определяют разбиение на группы и поэтому имеют фиксированные значения в каждой группе. Если указать измерение, не участвующее в построении чарта, то оно не будет иметь фиксированного значения — в каждой строке группы оно может быть разным. Невозможно будет определить, какое конкретно значение этого измерения должно быть выбрано при вычислении показателя. Ограничение справедливо для типов группировки `WITHIN` и `AMONG`. **Примеры:** * Корректная формула: `RANK(SUM([Profit]) WITHIN [Category])` в чарте с группировкой по измерениям `[Order Date]` и `[Category]`. Измерение `[Category]` участвует в построении чарта. * Допустимая формула: `RANK(SUM([Profit]) WITHIN [Category])` в чарте с группировкой по измерениям `[Order Date]` и `[City]`. Измерение `[Category]` не участвует в группировке, поэтому не будет использовано при вычислении. Результат будет равносилен применению формулы `RANK(SUM([Profit]) TOTAL)`. * Некорректная формула: `RANK(SUM([Profit]) AMONG [City])` в чарте с группировкой по измерениям `[Order Date]` и `[Category]`. Выполнение функции вызовет ошибку {link: unknown_win_dimension: Unknown dimension for window}. 1. В оконных функциях не поддерживается управление {link: lod_link: уровнем детализации}. Это доступно только для агрегатных функций. 1. Для функций, зависящих от порядка сортировки, перечисленные в `ORDER BY` поля должны участвовать в построении чарта. 1. В настройках чарта типа **Таблица** не рекомендуется включать отображение **Итого**, если при построении таблицы используется оконная функция. Это может вызвать ошибку.

source: ## Syntax {#syntax} The general syntax for window functions is as follows: {text:window_func_signature} It starts off, just like a regular function call, with its name and arguments (`arg1, arg2, ...` in this case). ### Grouping {#syntax-grouping} The arguments are followed by a window grouping, which can be one of three types: * `TOTAL` (equivalent to `WITHIN` without dimensions): all query entries fall into a single window. * `WITHIN dim1, dim2, ...` : records are grouped by the dimensions `dim1, dim2, ...`. * `AMONG dim1, dim2, ...` : records are grouped by all dimensions from the query, except those listed. For example, if we use formula `RSUM(SUM([Sales]) AMONG dim1, dim2)` with dimensions `dim1`, `dim2`, `dim3`, `dim4` in the data query, then the entries will be grouped by `dim3` and `dim4`, so it will be equivalent to `RSUM([Sales] WITHIN dim3, dim4)`. The grouping clause is optional. `TOTAL` is used by default. {text:window_syntax_ordering} {text:window_syntax_bfb}
ru: ## Синтаксис {#syntax} Общий синтаксис оконных функций выглядит так: {text:window_func_signature} Как и у обычных функций, вызов начинается с названия функции и аргументов (в данном случае — `arg1, arg2, ...`). ### Группировка {#syntax-grouping} За аргументами следует указание группировки окна, которое может быть одним из трех типов: * `TOTAL` (равносильно `WITHIN` без измерений): все записи запроса попадают в одно единственное окно. * `WITHIN dim1, dim2, ...` : записи группируются по измерениям `dim1, dim2, ...``dim1, dim2, ...` * `AMONG dim1, dim2, ...` : записи группируются по всем измерениям из запроса, кроме перечисленных. Например, если использовать формулу `RSUM(SUM([Sales]) AMONG dim1, dim2)` с измерениями `dim1`, `dim2`, `dim3`, `dim4` в запросе данных, то записи будут группироваться по `dim3` и `dim4`, так что эта формула будет эквивалентна `RSUM([Sales] WITHIN dim3, dim4)`. Группировка опциональна. По умолчанию используется тип группировки `TOTAL`. {text:window_syntax_ordering} {text:window_syntax_bfb}

source: ### Ordering {#syntax-order-by} After the grouping comes the ordering clause. It is only supported for order-dependent functions: {table:order_dep_win_functions} The ordering clause is optional for these functions. See the descriptions of these functions for more information on how this order affects the result value. The `ORDER BY` clause accepts dimensions as well as measures. It also supports the standard `ASC`/`DESC` syntax (`ASC` is assumed by default) to specify ascending or descending order respectively: `... ORDER BY [Date] ASC, SUM([Sales]) DESC, [Category] ...` Fields listed in `ORDER BY` are combined with fields listed in the chart's sorting section. Example: * Function — `... ORDER BY [Date] DESC, [City]`. * Chart — Sorted by `Date` and `Category`. * Result — `Date` (descending), `City`, `Category`.
ru: ### Сортировка {#syntax-order-by} За группировкой следует сортировка (`ORDER BY`). Она поддерживается только для функций, зависящих от порядка сортировки: {table:order_dep_win_functions} Сортировка для этих функций опциональна. Результат функции зависит от полей и направления сортировки. Чтобы узнать, как сортировка влияет на расчеты, перейдите к описанию функции. В сортировке допустимо использовать как измерения, так и показатели. Также поддерживается стандартный синтаксис `ASC`/`DESC` для указания направления сортировки: по нарастанию или убыванию (по умолчанию используется `ASC`): `... ORDER BY [Date] ASC, SUM([Sales]) DESC, [Category] ...` Перечисленные в `ORDER BY` поля дополняются списком полей из сортировки чарта. Пример: * Функция — `... ORDER BY [Date] DESC, [City]`. * Чарт — сортировка по `Date` и `Category`. * Результат сортировки — `Date` (по убыванию), `City`, `Category`.

source: Positional functions
ru: Позиционные функции

source: ### BEFORE FILTER BY {#syntax-before-filter-by} If any fields are listed in `BEFORE FILTER BY`, then this window function is calculated before data is filtered using these fields. `BEFORE FILTER BY` applies to all nested window functions too. Example: * Formula — `MAVG(RSUM([Sales]), 10 BEFORE FILTER BY [Date])`. * Equivalent — `MAVG(RSUM([Sales] BEFORE FILTER BY [Date]), 10 BEFORE FILTER BY [Date])`. Do not use conflicting `BEFORE FILTER BY` clauses: * Correct formula: `MAVG(RSUM([Sales] BEFORE FILTER BY [Date], [Category]), 10 BEFORE FILTER BY [Date])` — functions are nested and (`[Date]`) is a subset of (`[Date], [Category]`). * Correct formula: `MAVG(RSUM([Sales] BEFORE FILTER BY [Category]), 10 BEFORE FILTER BY [Date])` — functions are nested, so field lists are combined in the second of the two functions. * Correct formula: `RSUM([Sales] BEFORE FILTER BY [Date], [Category]) - RSUM([Sales] BEFORE FILTER BY [Date])` — (`[Date]`) is a subset of (`[Date], [Category]`). * Incorrect formula: `RSUM([Sales] BEFORE FILTER BY [Category]) - RSUM([Sales] BEFORE FILTER BY [Date])` — functions are not nested and neither of (`[Category]`) and (`[Date]`) is a subset of the other.
ru: ### BEFORE FILTER BY {#syntax-before-filter-by} Если какие-либо поля перечислены в `BEFORE FILTER BY`, то эта оконная функция будет рассчитана до фильтрации данных по этим полям. `BEFORE FILTER BY` применяется также и ко всем вложенным оконным функциям. Пример: * Формула — `MAVG(RSUM([Sales]), 10 BEFORE FILTER BY [Date])`. * Эквивалент — `MAVG(RSUM([Sales] BEFORE FILTER BY [Date]), 10 BEFORE FILTER BY [Date])`. Не используйте конфликтующие `BEFORE FILTER BY` в запросе: * Корректная формула: `MAVG(RSUM([Sales] BEFORE FILTER BY [Date], [Category]), 10 BEFORE FILTER BY [Date])` — функции вложены друг в друга, и (`[Date]`) является подмножеством (`[Date], [Category]`). * Корректная формула: `MAVG(RSUM([Sales] BEFORE FILTER BY [Category]), 10 BEFORE FILTER BY [Date])` — функции вложены друг в друга, поэтому списки полей комбинируются во второй из функций. * Корректная формула: `RSUM([Sales] BEFORE FILTER BY [Date], [Category]) - RSUM([Sales] BEFORE FILTER BY [Date])` — (`[Date]`) является подмножеством (`[Date], [Category]`). * Некорректная формула: `RSUM([Sales] BEFORE FILTER BY [Category]) - RSUM([Sales] BEFORE FILTER BY [Date])` — функции не вложены, и ни одно из (`[Category]`) и (`[Date]`) не является подмножеством другого.

source: ## Aggregate Functions as Window Functions {#aggregate-functions-as-window-functions} The following aggregations can also be used as window functions: {table:agg_as_window_table} To use the window version of the aggregate functions, you must explicitly specify the grouping (unlike other window functions, where it is optional). For example, the `SUM([Sales]) / SUM(SUM([Sales]) TOTAL)` expression can be used to calculate the ratio of a group's sum of `[Sales]` to the sum of `[Sales]` among all entries.
ru: ## Агрегатные функции как оконные {#aggregate-functions-as-window-functions} Следующие агрегатные функции могут быть использованы как оконные: {table:agg_as_window_table} Для использования их оконных вариантов необходимо явно указывать группировку (в отличие от остальных оконных функций, где она опциональна). Например, выражение `SUM([Sales]) / SUM(SUM([Sales]) TOTAL)` может быть использовано для расчета доли суммы `[Sales]` по группе к итоговой сумме `[Sales]` среди всех записей.

source: Aggregations
ru: Агрегации

source: Conditional Aggregations
ru: Условные агрегации

source: Returns the sum of all expression values. Applicable to numeric data types only.
ru: Возвращает сумму всех значений выражения. Работает только с числовыми типами данных.

source: Returns the sum of all the expression values that meet the {arg:1} condition. Applicable to numeric data types only.
ru: Возвращает сумму всех значений выражения, которые удовлетворяют условию {arg:1}. Работает только с числовыми типами данных.

source: Returns the average of all values. Applicable to numeric data types as well as {type:DATE|DATETIME}.
ru: Возвращает среднее для всех значений. Работает с числовыми типами данных и с типами {type:DATE|DATETIME}.

source: Returns the average of all values that meet the {arg:1} condition. If the values don't exist, it returns `NULL`. Applicable to numeric data types only.
ru: Возвращает среднее для всех значений, которые удовлетворяют условию {arg:1}. Если значения отсутствуют, то возвращается `NULL`. Работает только с числовыми типами данных.

source: Returns the maximum value. If {arg:0}: - number — Returns the largest number. - date — Returns the latest date. - string — Returns the last value in the alphabetic order.
ru: Возвращает максимальное значение. Если {arg:0}: - число — возвращает наибольшее число; - дата — возвращает самую позднюю дату; - строка — возвращает последнее значение в алфавитном порядке.

source: Returns the minimum value. If {arg:0}: - number — Returns the smallest number. - date — Returns the earliest date. - string — Returns the first value in the alphabetic order.
ru: Возвращает минимальное значение. Если {arg:0}: - число — возвращает наименьшее число; - дата — возвращает самую раннюю дату; - строка — возвращает первое значение в алфавитном порядке.

source: Returns the number of items in the group. Can be used with constants, such as `COUNT(1)` or `COUNT()`. If the chart does not use other measures and dimensions, the result of such an expression will always be `1`. This is because the function does not include any fields, so {{ datalens-short-name }} accesses no source tables in the query.
ru: Возвращает количество элементов в группе. Функцию можно использовать с константами, например, `COUNT(1)` или `COUNT()`. Если в чарте не используются другие показатели и измерения, результатом такого выражения всегда будет значение `1`. Это происходит из-за того, что в функции не указано ни одного поля, поэтому {{ datalens-short-name }} в запросе не обращается ни к одной таблице источника.

source: Returns the number of items in the group meeting the {arg:0} condition.
ru: Возвращает количество элементов в группе, которые удовлетворяют условию {arg:0}.

source: Returns the number of unique values in the group. See also {ref:COUNTD_APPROX}.
ru: Возвращает количество уникальных значений в группе. См. также {ref:COUNTD_APPROX}.

source: Returns the number of unique values in the group that meet the {arg:1} condition. See also {ref:COUNTD_APPROX}.
ru: Возвращает количество уникальных значений в группе, которые удовлетворяют условию {arg:1}. См. также {ref:COUNTD_APPROX}.

source: Returns the approximate number of unique values in the group. Faster than {ref:COUNTD}, but doesn't guarantee accuracy.
ru: Возвращает приблизительное количество уникальных значений в группе. Работает быстрее функции {ref:COUNTD}, но не гарантирует точность.

source: Returns the statistical {link: standard_dev: standard deviation} of all values in the expression based on a selection from the population.
ru: Возвращает статистическое {link: standard_dev: стандартное отклонение} всех значений в выражении на основе выборки из совокупности.

source: Returns the statistical {link: standard_dev: standard deviation} of all values in the expression based on the biased population. The function shows how far data points are from their average. In other words, standard deviation shows to what extent values in a dataset deviate from their average.
ru: Возвращает статистическое {link: standard_dev: стандартное отклонение} всех значений в выражении на основе смещенной совокупности. Функция показывает, насколько разбросаны точки данных относительно их среднего значения. Другими словами, стандартное отклонение показывает, как сильно значения в наборе данных отклоняются от среднего значения.

source: Returns the statistical variance of all values in an expression based on a selection from the population.
ru: Возвращает статистическую дисперсию всех значений в выражении на основе выборки из совокупности.

source: Returns the statistical variance of all values in an expression across the entire population.
ru: Возвращает статистическую дисперсию всех значений в выражении по всей совокупности.

source: Returns the precise {arg:1}-level quantile ({arg:1} should be in range from 0 to 1).
ru: Возвращает точный квантиль уровня {arg:1} (значение от 0 до 1).

source: Returns the approximate {arg:1}-level quantile ({arg:1} should be in range from 0 to 1).
ru: Возвращает примерный квантиль уровня {arg:1} (значение от 0 до 1).

source: Returns the {link: median_link: median} value. For an even number of items, it returns the greatest of the neighboring items in the central position.
ru: Возвращает {link: median_link: медианное} значение. При четном количестве элементов возвращает наибольший из соседних элементов в центральной позиции.

source: Returns one of the values of {arg:0} from the group. This is a nondeterministic aggregation — the result may vary for the same data over multiple queries.
ru: Возвращает произвольное значение {arg:0} из группы. Это недетерминированная агрегация — результат может различаться от запроса к запросу на одних и тех же входных данных.

source: Returns {arg:0} for the minimum value of {arg:1} in the group. If multiple values of {arg:0} match the minimum value of {arg:1}, then the first one encountered is returned. This makes the function non-deterministic.
ru: Возвращает значение {arg:0}, соответствующее минимальному значению {arg:1}. Если есть несколько значений {arg:0}, соответствующих минимальному значению {arg:1}, то возвращает первое попавшееся из них. Это делает функцию недетерминированной.

source: Returns {arg:0} for the maximum value of {arg:1} in the group. If multiple values of {arg:0} match the maximum value of {arg:1}, then the first one encountered is returned. This makes the function non-deterministic.
ru: Возвращает значение {arg:0}, соответствующее максимальному значению {arg:1}. Если есть несколько значений {arg:0}, соответствующих максимальному значению {arg:1}, то возвращает первое попавшееся из них. Это делает функцию недетерминированной.

source: Returns a string that contains all unique values of {arg:0} delimited by {arg:1} (if {arg:1} is not specified, a comma is used).
ru: Возвращает строку, которая содержит все уникальные значения {arg:0}, разделенные {arg:1} (по умолчанию разделитель — запятая).

source: Returns a string that contains top {arg:1} unique values of {arg:0} delimited by {arg:2} (if {arg:2} is not specified, a comma is used).
ru: Возвращает строку, которая содержит {arg:1} наиболее часто встречающихся уникальных значений из {arg:0}, разделенных {arg:2} (по умолчанию разделитель — запятая).

source: Returns an array containing the passed values.
ru: Возвращает массив, содержащий переданные элементы.

source: All passed values must be of the same type or `NULL`. At least one value must be non-`NULL`.
ru: Все переданные элементы должны быть одинакового типа или `NULL`. Хотя бы один элемент должен быть не `NULL`.

source: Expands the {arg:0} array expression to a set of rows.
ru: Дублирует исходную строку для каждого элемента массива {arg:0}.
