Repository: datalens-tech/datalens-backend
Catalog: lib/bi_api_lib/bi_api_lib/locales/*/LC_MESSAGES/bi_api_lib.po
Languages: ru

# field_oauth-token
source: OAuth token
ru: OAuth-токен

# button_get-token
source: Get token
ru: Получить токен

# label_token
source: Token
ru: Токен

# label_portal
source: Portal
ru: Портал

# label_connector-bitrix
source: Bitrix24
ru: Битрикс24

# label_connector-file
source: Files
ru: Файлы

# field_google-sheets-link
source: Url
ru: Ссылка

# label_gsheets-url-hint
source: In Google Sheets, grant «Anyone with the link» access and then copy the link to the sheet from the address bar in your browser.
ru: В Google Sheets необходимо предоставить доступ "Anyone with the link", затем из адресной строки браузера скопировать ссылку на нужный лист.

# label_connector-monitoring
source: Monitoring
ru: Мониторинг

# label_solomon-conn-description
source: This connection allows you to create charts in DataLens according to the [Yandex Monitoring (Solomon)]({LINK}) data
ru: Подключение позволяет создавать графики в DataLens по данным сервиса [Yandex Monitoring (Solomon)]({LINK})

# field_sa-key
source: SA key
ru: Ключ SA

# field_click-house-port
source: HTTP interface port
ru: Порт HTTP-интерфейса

# label_clickhouse-ssl-enabled-tooltip
source: When the option is enabled, the HTTPS protocol is used when interacting with the database, and when disabled — HTTP
ru: Когда опция включена, при взаимодействии с БД используется протокол HTTPS, когда выключена — HTTP

# field_enforce-collate
source: Specifying collate in the request
ru: Указание collate в запросе

# value_enforce-collate-auto
source: Auto
ru: Авто

# value_enforce-collate-off
source: Off
ru: Выкл

# value_enforce-collate-on
source: On
ru: Вкл

# label_postgres-ssl-enabled-tooltip
source: When the option is enabled, the sslmode parameter takes the value required, and when disabled — prefer
ru: Когда опция включена, параметр sslmode принимает значение required, когда выключена — prefer

# label_ydb-host-tooltip
source: Available clusters: `ydb-ru`, `ydb-ru-prestable`, `ydb-eu` Details in [documentation](https://docs.yandex-team.ru/docs/ydb/getting_started/start_chydb).
ru: Доступные кластера: `ydb-ru`, `ydb-ru-prestable`, `ydb-eu` Подробности в [документации](https://docs.yandex-team.ru/docs/ydb/getting_started/start_chydb).

# field_default-cluster
source: Default cluster
ru: Кластер по умолчанию

# field_default-database
source: Default database name
ru: Имя базы данных по умолчанию

# field_clique-alias
source: Clique alias
ru: Алиас клики

# field_chyt-token
source: YTsaurus token
ru: Токен YTsaurus

# label_connector-appmetrica
source: AppMetrica
ru: AppMetica

# section_title-db
source: Databases
ru: Базы данных

# section_title-files_and_services
source: Files and services
ru: Файлы и сервисы

# section_title-partner
source: Partner connections
ru: Партнерские подключения
