Repository: datalens-tech/datalens-backend
Catalog: mainrepo/lib/bi_core/bi_core/locales/*/LC_MESSAGES/bi_core.po
Languages: ru

# source_templates-tab_title-table
source: Table
ru: Таблица

# source_templates-label-ydb_table
source: YDB table path
ru: Путь к таблице в YDB

# source_templates-label-ytsaurus_table
source: Path to a YTsaurus table
ru: Путь к таблице в YTsaurus

# source_templates-tab_title-concat
source: Concat
ru: Список

# source_templates-label-ytasurus_table_list
source: Path to YTsaurus tables, one per line
ru: Пути к таблицам в YTsaurus

# source_templates-tab_title-range
source: Range
ru: Диапазон

# source_templates-label-ytsaurus_dir
source: Path to a YTsaurus directory
ru: Путь к каталогу в YTsaurus

# source_templates-label-range_from
source: Start from
ru: Начать с

# source_templates-label-range_to
source: End at
ru: Закончить на

# source_templates-label-yt_table
source: Path to a YT table
ru: Путь к таблице в YT

# source_templates-label-yt_table_list
source: Path to YT tables, one per line
ru: Пути к таблицам в YT

# source_templates-label-yt_dir
source: Path to a YT directory
ru: Путь к каталогу в YT

# source_templates-label-subquery
source: Subquery
ru: Подзапрос
