Repository: datalens-tech/datalens-backend
Catalog: lib/bi_connector_bundle_ch_filtered_ya_cloud/bi_connector_bundle_ch_filtered_ya_cloud/locales/*/LC_MESSAGES/bi_connector_bundle_ch_filtered_ya_cloud.po
Languages: ru

# label_ch-geo-filtered-description
source: This is a service connection for interactions datasets with geolayers. You can set up a connection in [Marketplace](/marketplace)
ru: Это служебное подключение для работы датасетов с геослоями. Соединение можно настроить в [Marketplace](/marketplace)

# label_connector-ch_geo_filtered
source: Geolayer
ru: Геослой

# cloud-datalens-docs-url
source: https://cloud.yandex.com/docs/datalens
ru: https://cloud.yandex.ru/docs/datalens

# label_ya-podcasts-conn-description
source: This connection lets you check your podcasts' detailed statistics. By clicking the button below you will be given the key (OAuth-token) â€” the tool which lets DataLens show information about your podcast. You can give access to statistics to other people yourself, just like it described in [documentation]({SEC_LINK}). You can make the access to stats private any time you'd like. All you need to do is to revoke the issued token in [Yandex ID]({PASSPORT_LINK}).
ru: Это подключение позволит вам просматривать детальную статистику прослушивания ваших подкастов. По кнопке ниже вы получите ключ (OAuth-токен) — инструмент, который позволит системе DataLens отобразить информацию по вашим подкастам. Вы сможете самостоятельно выдавать доступы к статистике другим людям, как описано в [документации]({SEC_LINK}). Доступ можно в любой момент закрыть, отозвав выписанный токен в [Яндекс ID]({PASSPORT_LINK}).

# label_connector-ch_ya_music_podcast_stats
source: Podcasts Analytics
ru: Подкасты Аналитика

# label_market-couriers-description
source: This connection lets you check statistics about couriers and their completed tasks. The information is available only to partners who have accepted the offer. By clicking the button below, you will receive a key (OAuth token) - a tool that lets DataLens to show information about your tasks and performers. You can give access to statistics to other people yourself, just like it described in [documentation]({SEC_LINK}). All you need to do is to revoke the issued token in [Yandex ID]({PASSPORT_LINK}).
ru: Это подключение позволит вам просматривать статистику о курьерах и выполненных ими заданиях. Информация доступна только партнёрам, принявшим оферту. По кнопке ниже вы получите ключ (OAuth-токен) — инструмент, который позволит системе DataLens отобразить информацию о ваших заданиях и исполнителях. Вы сможете самостоятельно выдавать доступы к статистике другим людям, как описано в [документации]({SEC_LINK}). Доступ можно в любой момент закрыть, отозвав выписанный токен в [Яндекс ID]({PASSPORT_LINK}).

# label_connector-market_couriers
source: Market Couriers
ru: Маркет Курьеры

# label_schoolbook-journal-description
source: This connection lets you check your detailed statistics about your students' work in the Computer Science course from Yandex.Schoolbook. You can give access to statistics to other people yourself. See more in the DataLens [documentation]({SEC_LINK}). You can make the access to stats private any time you'd like. All you need to do is to revoke the issued token in [Yandex ID]({PASSPORT_LINK}).
ru: Это подключение позволит вам просматривать подробную статистику о работе ваших учеников по курсу «Информатика» от Яндекс.Учебника. Вы сможете самостоятельно выдавать доступы к статистике другим людям. См. подробнее в документации [DataLens]({SEC_LINK}). Доступ можно в любой момент закрыть. Для этого достаточно отозвать токен в [Яндекс ID]({PASSPORT_LINK}).

# label_connector-schoolbook_journal
source: Yandex.Schoolbook
ru: Яндекс.Учебник

# label_connector-smb_heatmaps
source: Heatmaps Yandex Direct
ru: Тепловые карты Яндекс Директа

# label_smb-heatmaps-description
source: As a source, the data of the Heat Maps tool will be used, which, according to the specified conditions, visualize supply and demand polygons on the map in the context of Yandex Direct headings. This connection will allow you to access Heatmaps from the Yandex Direct team. You will be able to study, in the context of polygons and headings, metrics relating to supply and demand in the city. Detailed work with the tool is described in the DataLens documentation. Access can be closed at any time. To do this, it will be enough to contact your manager.
ru: В качестве источника будут использованы данные инструмента «Тепловые карты», которые по заданным условиям визуализируют на карте полигоны спроса и предложения в разрезе рубрик Яндекс Директа. Данное подключение позволит вам получить доступ к Тепловым картам от команды Яндекс Директа. Вы сможете изучить, в разрезе полигонов и рубрик, метрики, касающихся спроса и предложения в городе. Подробная работа с инструментом описана в документации DataLens. Доступ можно закрыть в любой момент. Для этого достаточно будет обратиться к вашему менеджеру.
